[
  {
    "title": "PRED: Performance-oriented Random Early Detection for Consistently Stable Performance in Datacenters",
    "authors": "Xinle Du,Huawei Technologies;Tong Li,Renmin University of China;Guangmeng Zhou, Zhuotao Liu, Hanlin Huang, and Xiangyu Gao,Tsinghua University;Mowei Wang and Kun Tan,Huawei Technologies;Ke Xu,Tsinghua University",
    "abstract": "For decades, Random Early Detection (RED) has been integrated into datacenter switches as a fundamental Active Queue Management (AQM). Accurate configuration of RED parameters is crucial to achieving high throughput and low latency. However, due to the highly dynamic nature of workloads in datacenter networks, maintaining consistently high performance with statically configured RED thresholds poses a challenge. Prior art applies reinforcement learning to predict proper thresholds, but their real-world deployment has been hindered by poor tail performance caused by instability. In this paper, we propose PRED, a novel system that enables automatic and stable RED parameter adjustment in response to traffic dynamics. PRED uses two loosely coupled systems, Flow Concurrent Stabilizer (FCS) and Queue Length Adjuster (QLA), to overcome the challenges of dynamically setting RED parameters to adapt to the ever-changing traffic pattern. We perform extensive evaluations on our physical testbed and large-scale simulations. The results demonstrate that PRED can keep up with the real-time network dynamics generated by realistic workloads. For instance, compared with the static-threshold-based methods, PRED keeps 66%lower switch queue length and obtains up to 80% lower Flow Completion Time (FCT). Compared with the state-of-the-art learning-based method, PRED reduces the tail FCT by 34%.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/du",
    "session_title": "Data Centers Queuing and Routing",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "95dfb6a3-2009-437e-960e-14354eeccab7"
  },
  {
    "title": "Rajomon: Decentralized and Coordinated Overload Control for Latency-Sensitive Microservices",
    "authors": "Jiali Xing, Akis Giannoukos, Paul Loh, Shuyue Wang, and Justin Qiu,University of Pennsylvania;Henri Maxime Demoulin,DBOS, inc;Konstantinos Kallas,University of California, Los Angeles;Benjamin Lee,University of Pennsylvania",
    "abstract": "Microservices are increasingly central for cloud applications due to their flexibility and support for rapid integration and deployment. However, applications often experience overload or sudden traffic surges that exceed service capacity, resulting in increased latency or service failures. Moreover, microservices are decentralized, interdependent, and multiplexed, exacerbating risks from overload.\nWe present RAJOMON, a market-based overload control system for large microservice graphs. RAJOMON controls overload through distributed rate-limiting and load shedding. Clients attach tokens to requests and services charge a price for each API, dropping requests with insufficient tokens. Tokens and prices propagate through the entire call graph, piggybacking on requests and responses. Thus, RAJOMON is the first decentralized, end-to-end overload control system.\nWe implement and evaluate RAJOMON on a setup of up to 140 cores and on a variety of applications from academia and industry. Experiments indicate RAJOMON protects microservice goodput and tail latency from substantial demand spikes, even in the case of mixed request types and deeper service graphs. For high-load scenarios, RAJOMON reduces tail latency by 78% and increases goodput by 45% when compared against state-of-the-art overload control for microservices.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/xing",
    "session_title": "Data Centers Queuing and Routing",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "51a052a2-c306-440f-be22-e80cb9032586"
  },
  {
    "title": "Learnings from Deploying Network QoS Alignment to Application Priorities for Storage Services",
    "authors": "Matthew Buckley and Parsa Pazhooheshy,Google and University of Toronto;Z. Morley Mao, Nandita Dukkipati, Hamid Hajabdolali Bazzaz, Priyaranjan Jha, Yingjie Bi, and Steve Middlekauff,Google;Yashar Ganjali,University of Toronto",
    "abstract": "To ensure that application network traffic is prioritized correctly within data center networks, it is critical to align the configuration of network QoS in packets to the intended priority of the application. These QoS configurations, typically encoded in the DSCP bits in the IP header, are interpreted by network switches and routers to determine the resources such as buffer space and scheduling priorities, for network traffic. Conceptually, it appears fairly straightforward to map the application priorities within data center networks to network QoS configurations, as long as the mapping is well defined. In this work, we describe our experience of aligning network QoS settings for intra-cluster storage traffic to application priorities on a per-RPC basis for a large data center network, with well-defined static mappings from priorities to QoS traffic classes. We describe some unexpected insights learned from the deployment experiences, e.g., downgrading traffic to use a lower QoS does not always imply worse network latency due to over-used QoS bands in the network. We also share some challenges encountered along the way to reach the goal of a fleet-wide deployment, including the concerns of potential performance regressions due to QoS downgrades. These lessons provide guidance on the use of a QoS-based scheduling strategy to meet service guarantees and can be deployed to networks of any scale.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/buckley",
    "session_title": "Data Centers Queuing and Routing",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "29169281-37c3-40a6-b019-2d4d945c5ed4"
  },
  {
    "title": "DiSC: Backpressure Mitigation In Multi-tier Applications With Distributed Shared Connection",
    "authors": "Brice Ekane and Djob Mvondo,Univ Rennes, CNRS, INRIA, IRISA;Renaud Lachaize,University Grenoble Alpes;Yérom-David Bromberg,Univ Rennes, CNRS, INRIA, IRISA;Alain Tchana,Grenoble INP;Daniel Hagimont,University of Toulouse, Toulouse, France",
    "abstract": "Most data-center applications are based on a multi-tier architecture, involving either coarse-grained software components (e.g., traditional 3-tier web applications) or fine-grained ones (e.g., microservices). Such applications are prone to the backpressure problem, which introduces a strong performance coupling between tiers, thus degrading scalability and resource consumption. This problem is due to the fact that, on the response path towards the initial client, a significant fraction of the payloads in the messages exchanged between tiers correspond to “final” data that are simply relayed (i.e., without further modifications) from a backend tier such as a database. This traffic results in additional pressure on the intermediate and frontend tiers.\nTo address this problem, we introduce DISC, a system allowing several tiers within a multi-tier chain to jointly act as endpoints of the same TCP connection. This enables the selective bypass of one or several tiers on the response path. Unlike existing solutions, DISC is (1) flexible — it accommodates arbitrary multi-tier topologies and heterogeneous application-level protocols, (2) fine-grained — it allows multiple tiers to be involved in the generation and emission of a given response message (e.g., to decouple the network path of the response headers and footers from the path of the response body), (3) and non-intrusive — it requires only minor and localized/modular modifications to the code base of legacy applications and is transparent for external clients. Evaluation results with several micro- and macro-benchmarks show that DISC can reduce the cumulative CPU load on servers by up to 41.5%, decrease the average and tail latencies respectively by up to 74.1% and 5.71×, and also improve the request rate by up to 45%.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/ekane",
    "session_title": "Data Centers Queuing and Routing",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "e3f81bf6-fedc-4a29-ac3d-c1ecc6b3b1d1"
  },
  {
    "title": "Enabling Silent Telemetry Data Transmission with InvisiFlow",
    "authors": "Yinda Zhang,University of Pennsylvania;Liangcheng Yu,University of Pennsylvania and Microsoft Research;Gianni Antichi,Politecnico di Milano and Queen Mary University of London;Ran Ben Basat,University College London;Vincent Liu,University of Pennsylvania",
    "abstract": "Network applications from traffic engineering to path tracing often rely on the ability to transmit fine-grained telemetry data from network devices to a set of collectors. Unfortunately, prior work has observed—and we validate—that existing transmission methods for such data can result in significant overhead to user traffic and/or loss of telemetry data, particularly when the network is heavily loaded.\nIn this paper, we introduce InvisiFlow, a novel communication substrate to collect network telemetry data, silently. In contrast to previous systems that always push telemetry packets to collectors based on the shortest path, InvisiFlow dynamically seeks out spare network capacity by leveraging opportunistic sending and congestion gradients, thus minimizing both the loss rate of telemetry data and overheads on user traffic. In a FatTree topology, InvisiFlow can achieve near-zero loss rate even under high-load scenarios (around 33.8× lower loss compared to the state-of-the-art transmission methods used by systems like Everflow and Planck).",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zhang-yinda",
    "session_title": "Data Plane Programmability 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "a5dd677d-30ed-4a8d-a763-c18cb5531556"
  },
  {
    "title": "Unlocking ECMP Programmability for Precise Traffic Control",
    "authors": "Yadong Liu,Tencent;Yunming Xiao,University of Michigan;Xuan Zhang, Weizhen Dang, Huihui Liu, Xiang Li, and Zekun He,Tencent;Jilong Wang,Tsinghua University;Aleksandar Kuzmanovic,Northwestern University;Ang Chen,University of Michigan;Congcong Miao,Tencent",
    "abstract": "ECMP (equal-cost multi-path) has become a fundamental mechanism in data centers, which distributes flows along multiple equivalent paths based on their hash values. Randomized distribution optimizes for the aggregate case, spreading load across flows over time. However, there exists a class of important Precise Traffic Control (PTC) tasks that are at odds with ECMP randomness. For instance, if an end host perceives that its flows are traversing a problematic switch/link, it often needs to change their paths before a fix can be rolled out. With randomized hashing, existing solutions resort to modifying flow tuples; since hashing mechanisms are unknown and they vary across switches/vendors, it may take many trials before yielding a new path. Many other similar cases exist where precise and timely response is critical to the network.\nWe propose programmable ECMP (P-ECMP), a programming model, compiler, and runtime that provides precise traffic control. P-ECMP leverages an oft-ignored feature, ECMP groups, which allows for a constrained set of capabilities that are nonetheless sufficiently expressive for our tasks. An operator supplies high-level descriptions of their topology and policies, and our compiler generates PTC configurations for each switch. End hosts can reconfigure specific flows to use different PTC policies precisely and quickly, addressing a range of important use cases. We have evaluated P-ECMP using simulation at scale, and deployed one use case to a real-world data center that serves live user traffic.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/liu-yadong",
    "session_title": "Data Plane Programmability 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "1d1a3f5c-f011-4780-83a4-b2f36c28c400"
  },
  {
    "title": "Portable and High-Performance SmartNIC Programs with Alkali",
    "authors": "Jiaxin Lin,The University of Texas at Austin;Zhiyuan Guo,University of California, San Diego;Mihir Shah,The University of Texas at Austin and NVIDIA;Tao Ji,The University of Texas at Austin and Microsoft;Yiying Zhang,University of California, San Diego;Daehyeok Kim and Aditya Akella,The University of Texas at Austin",
    "abstract": "Trends indicate that emerging SmartNICs, either from different vendors or generations from the same vendor, exhibit substantial differences in hardware parallelism and memory interconnects. These variations make porting programs across NICs highly complex and time-consuming, requiring programmers to significantly refactor code for performance based on each target NIC’s hardware characteristics.\nWe argue that an ideal SmartNIC compilation framework should allow developers to write target-independent programs, with the compiler automatically managing cross-NIC porting and performance optimization. We present such a framework, Alkali, that achieves this by (1) proposing a new intermediate representation for building flexible compiler infrastructure for multiple NIC targets and (2) developing a new iterative parallelism optimization algorithm that automatically ports and parallelizes the input programs based on the target NIC’s hardware characteristics.\nExperiments across a wide range of NIC applications demonstrate that Alkali enables developers to easily write portable, high-performance NIC programs. Our compiler optimization passes can automatically port these programs and make them run efficiently across all targets, achieving performance within 9.8% of hand-tuned expert implementations.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/lin-jiaxin",
    "session_title": "Data Plane Programmability 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "d7f824ef-35ae-41aa-a094-8c1baa5391cb"
  },
  {
    "title": "Scaling IP Lookup to Large Databases using the CRAM Lens",
    "authors": "Robert Chang and Pradeep Dogga,UCLA;Andy Fingerhut,Cisco;Victor Rios and George Varghese,UCLA",
    "abstract": "Wide-area scaling trends require new approaches to Internet Protocol (IP) lookup, enabled by modern networking chips such as Intel Tofino, AMD Pensando, and Nvidia BlueField, which provide substantial ternary content-addressable memory (TCAM) and static random-access memory (SRAM). However, designing and evaluating scalable algorithms for these chips is challenging due to hardware-level constraints. To address this, we introduce the CRAM (CAM+RAM) lens, a framework that combines a formal model for evaluating algorithms on modern network processors with a set of optimization idioms. We demonstrate the effectiveness of CRAM by designing and evaluating three new IP lookup schemes: RESAIL, BSIC, and MashUp. RESAIL enables Tofino-2 to scale to 2.25 million IPv4 prefixes$\\unicode{x2014}$likely sufficient for the next decade$\\unicode{x2014}$while a pure TCAM approach supports only 250k prefixes, just 27% of the current global IPv4 routing table. Similarly, BSIC scales to 390k IPv6 prefixes on Tofino-2, supporting 3.2 times as many prefixes as a pure TCAM implementation. In contrast, existing state-of-the-art algorithms, SAIL for IPv4 and Hi-BST for IPv6, scale to considerably smaller sizes on Tofino-2.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/chang",
    "session_title": "Data Plane Programmability 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "d55930a1-0fed-4843-aceb-f13ad602f9de"
  },
  {
    "title": "Quicksand: Harnessing Stranded Datacenter Resources with Granular Computing",
    "authors": "Zhenyuan Ruan,MIT CSAIL;Shihang Li,Brown University;Kaiyan Fan,MIT CSAIL;Seo Jin Park,University of Southern California;Marcos K. Aguilera,VMware Research by Broadcom;Adam Belay,MIT CSAIL;Malte Schwarzkopf,Brown University",
    "abstract": "Datacenters today waste CPU and memory, as resources demanded by applications often fail to match the resources available on machines. This leads to stranded resources because one resource that runs out prevents placing additional applications that could consume the other resources. Unusable stranded resources result in reduced utilization of servers, and wasted money and energy.\nQuicksand is a new framework and runtime system that unstrands resources by providing developers with familiar, high-level abstractions (e.g., data structures, batch computing). Internally Quicksand decomposes them into resource proclets, granular units that each primarily consume resources of one type. Inspired by recent granular programming models, Quicksand decouples consumption of resources as much as possible. It splits, merges, and migrates resource proclets in milliseconds, so it can use resources on any machine, even if available only briefly.\nEvaluation of our prototype with four applications shows that Quicksand uses stranded resources effectively; that Quicksand reacts to changing resource availability and demand within milliseconds, increasing utilization; and that porting applications to Quicksand requires moderate effort.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/ruan",
    "session_title": "Data Center Resource Scheduling",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "db850d0b-0d89-42a8-9942-00aa5d5029e4"
  },
  {
    "title": "Beehive: A Scalable Disaggregated Memory Runtime Exploiting Asynchrony of Multithreaded Programs",
    "authors": "Quanxi Li, Hong Huang, Ying Liu, and Yanwen Xia,University of Chinese Academy of Sciences;Jie Zhang,Peking University;Mosong Zhou,Huawei Cloud;Xiaobing Feng and Huimin Cui,University of Chinese Academy of Sciences;Quan Chen,Shanghai Jiao Tong University;Yizhou Shan,Huawei Cloud;Chenxi Wang,University of Chinese Academy of Sciences",
    "abstract": "The Microsecond (µs)-scale I/O fabrics raise a tension between the programming productivity and performance, especially in disaggregated memory systems. The multithreaded synchronous programming model is popular in developing memory-disaggregated applications due to its intuitive program logic. However, our key insight is that although thread switching can effectively mitigate µs-scale latency, it leads to poor data locality and non-trivial scheduling overhead, leaving significant opportunities to improve the performance further. This paper proposes a memory-disaggregated framework, Beehive, which improves the remote access throughput by exploiting the asynchrony within each thread. To improve the programming usability, Beehive allows the programmers to develop applications in the conventional multithreaded synchronous model and automatically transforms the code into pararoutine (a newly proposed computation and scheduling unit) based asynchronous code via the Rust compiler. Beehive outperforms the state-of-the-art memory-disaggregated frameworks, i.e., Fastswap, Hermit, and AIFM, by 4.26×, 3.05×, and 1.58× on average.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/li-quanxi",
    "session_title": "Data Center Resource Scheduling",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "60923286-b3b0-4e91-aac0-2c6e15528500"
  },
  {
    "title": "Making Serverless Pay-For-Use a Reality with Leopard",
    "authors": "Tingjia Cao, Andrea Arpaci-Dusseau, Remzi Arpaci-Dusseau, and Tyler Caraza-Harter,University of Wisconsin-Madison",
    "abstract": "Serverless computing has gained traction due to its event-driven architecture and “pay for use” (PFU) billing model. However, our analysis reveals that current billing practices do not align with true resource consumption. This paper challenges the prevailing SLIM (static, linear, interactive-only model) assumptions that underpin existing billing models, demonstrating that current billing does not realize PFU for realistic workloads. We introduce the Nearly Pay-for-Use (NPFU) billing model, which accommodates varying CPU and memory demands, spot cores, and preemptible memory. We also introduce Leopard, an NPFU-based serverless platform that integrates billing awareness into several major subsystems: CPU scheduler, OOM killer, admission controller, and cluster scheduler. Experimental results indicate that Leopard benefits both providers and users, increasing throughput by more than 2x and enabling cost reductions.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/cao",
    "session_title": "Data Center Resource Scheduling",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "4469ee4c-a8f9-42e1-b4b5-bde0852302fc"
  },
  {
    "title": "GRANNY: Granular Management of Compute-Intensive Applications in the Cloud",
    "authors": "Carlos Segarra, Simon Shillaker, Guo Li, and Eleftheria Mappoura,Imperial College London;Rodrigo Bruno,INESC-ID, Instituto Superior Técnico, Universidade de Lisboa;Lluis Vilanova and Peter Pietzuch,Imperial College London",
    "abstract": "Parallel applications are typically implemented using multi-threading (with shared memory, e.g., OpenMP) or multi-processing (with message passing, e.g., MPI). While it seems attractive to deploy such applications in cloud VMs, existing cloud schedulers fail to manage these applications efficiently: they cannot scale multi-threaded applications dynamically when more vCPUs in a VM become available, and they cause fragmentation over time because of the static allocation of multi-process applications to VMs.\nWe describe GRANNY, a new distributed runtime that enables the fine-granular management of  multi-threaded/process applications in cloud environments. GRANNY supports the vertical scaling of multi-threaded applications within a VM and the horizontal migration of multi-process applications between VMs. GRANNY achieves both through a single WebAssembly-based execution abstraction: Granules can execute application code with thread or process semantics and allow for efficient snapshotting. GRANNY scales up applications by adding more Granules at runtime, and de-fragments applications by migrating Granules between VMs. In both cases, it launches new Granules from snapshots efficiently. We evaluate GRANNY with dynamic scheduling policies and show that, compared to current schedulers, it reduces the makespan for OpenMP workloads by up to 60% and the fragmentation for MPI workloads by up to 25%.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/segarra",
    "session_title": "Data Center Resource Scheduling",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "2f0795ae-4581-4fa4-b210-0948b0125071"
  },
  {
    "title": "On Temporal Verification of Stateful P4 Programs",
    "authors": "Delong Zhang, Chong Ye, and Fei He,School of Software, BNRist, Tsinghua University, Beijing 100084, China; Key Laboratory for Information System Security, MoE, China",
    "abstract": "Stateful P4 programs offload network states from the control plane to the data plane, enabling unprecedented network programmability. However, existing P4 verifiers overapproximate the stateful nature of P4 programs and are inherently inadequate for verifying network functions that require stateful decision-making.\nTo overcome this limitation, this paper introduces an innovative approach to verify P4 programs while accounting for their stateful feature. We propose a specification language named P4LTL, tailored for describing temporal properties of stateful P4 programs at the packet processing level. Additionally, we introduce a novel concept called the Büchi transaction, representing the product of the P4 program and the P4LTL specification. The P4 program verification problem can be reduced to determining the existence of any fair and feasible trace within the Büchi transaction. To the best of our knowledge, our approach represents the first endeavor in temporal verification of stateful P4 programs at the packet processing level. We implemented a prototype tool called p4tv. Evaluation results demonstrate p4tv’s effectiveness and efficiency in temporal verification of stateful P4 programs.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zhang-delong",
    "session_title": "Verification 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "32e31398-383b-47f2-9ef1-7a6559be7de6"
  },
  {
    "title": "NDD: A Decision Diagram for Network Verification",
    "authors": "Zechun Li, Peng Zhang, and Yichi Zhang,Xi'an Jiaotong University;Hongkun Yang,Google",
    "abstract": "Network verification promises to detect errors, such as black holes and forwarding loops, by logically analyzing the control or data plane. To do so efficiently, the state-of-the-art (e.g., Veriflow) partitions packet headers with identical forwarding behavior into the same packet equivalence class (PEC).Recently, Yang and Lam showed how to construct the minimal set of PECs, called atomic predicates. Their construction uses Binary Decision Diagrams (BDDs). However, BDDs have been shown to incur significant overhead per packet header bit, performing poorly when analyzing large-scale data centers. The overhead of atomic predicates prompted ddNF to devise a specialized data structure of Ternary Bit Vectors (TBV) instead.However, TBVs are strictly less expressive than BDDs. Moreover, unlike atomic predicates, ddNF’s set of PECs is not minimal. We show that ddNF’s non-minimality is due to empty PECs. In addition, empty PECs are shown to trigger wrong analysis results. This reveals an inherent tension between precision, expressiveness and performance in formal network verification.Our paper resolves this tension through a new lattice-theoretical PEC-construction algorithm, # PEC, that advances the field as follows: (i) # PEC can encode more kinds of forwarding rules (e.g., ip-tables) than ddNF and Veriflow, (ii) # PEC verifies a wider class of errors (e.g., shadowed rules) than ddNF, and (iii) on a broad range of real-world datasets, # PEC is 10\\times faster than atomic predicates. By achieving precision, expressiveness and performance, this paper answers a longstanding quest that has spanned three generations of formal network analysis techniques.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/li-zechun",
    "session_title": "Verification 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "45506da9-d18b-4ee4-aad1-b176619526c4"
  },
  {
    "title": "Smart Casual Verification of the Confidential Consortium Framework",
    "authors": "Heidi Howard, Markus A. Kuppe, Edward Ashton, and Amaury Chamayou,Azure Research, Microsoft;Natacha Crooks,Azure Research, Microsoft and UC Berkeley",
    "abstract": "The Confidential Consortium Framework (CCF) is an open-source platform for developing trustworthy and reliable cloud applications. CCF powers Microsoft's Azure Confidential Ledger service and as such it is vital to build confidence in the correctness of CCF's design and implementation. This paper reports our experiences applying smart casual verification to validate the correctness of CCF's novel distributed protocols, focusing on its unique distributed consensus protocol and its custom client consistency model. We use the term smart casual verification to describe our hybrid approach, which combines the rigor of formal specification and model checking with the pragmatism of automated testing, in our case binding the formal specification in TLA+ to the C++ implementation. While traditional formal methods approaches require substantial buy-in and are often one-off efforts by domain experts, we have integrated our smart casual verification approach into CCF's CI pipeline, allowing contributors to continuously validate CCF as it evolves. We describe the challenges we faced in applying smart casual verification to a complex existing codebase and how we overcame them to find six subtle bugs in the design and implementation before they could impact production.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/howard",
    "session_title": "Verification 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "10495508-a417-49ba-b2fd-c8f9afe30176"
  },
  {
    "title": "VEP: A Two-stage Verification Toolchain for Full eBPF Programmability",
    "authors": "Xiwei Wu, Qinxiang Cao, Shizhen Zhao, Yueyang Feng, Tianyi Huang, Xiaoyang Lu, Lihan Xie, and Shengkai Lin,Shanghai Jiao Tong University",
    "abstract": "Extended Berkely Package Filter (eBPF) is a revolutionary technology that can safely and efficiently extend kernel capabilities. It has been widely used in networking, tracing, security, and more. However, existing eBPF verifiers impose strict constraints, often requiring repeated modifications to eBPF programs to pass verification. To enhance programmability, we introduce VEP, an annotation-guided eBPF program verification toolchain. VEP consists of three components: VEP-C, a verifier for annotated eBPF-C programs; VEP-compiler, a compiler targeting annotated eBPF bytecode; and VEP-eBPF, a lightweight bytecode-level proof checker. VEP allows users to verify the correctness of their programs with appropriate annotations, thus enabling full programmability. Our experimental results demonstrate that VEP addresses the limitations of existing verifiers, i.e. the Linux verifier and PREVAIL, and provides a more flexible and automated approach to kernel security.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wu-xiwei",
    "session_title": "Verification 1",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "32568efa-c928-4944-a8e6-4b168283d795"
  },
  {
    "title": "MeshTest: End-to-End Testing for Service Mesh Traffic Management",
    "authors": "Naiqian Zheng, Tianshuo Qiao, Xuanzhe Liu, and Xin Jin,Peking University",
    "abstract": "We present MeshTest, the first end-to-end testing framework for traffic management of service mesh. The key idea of MeshTest is to automatically generate input configurations with end-to-end semantics, and then create real test request suites on each input. There are two technical challenges. First, the input space of service mesh configurations is large and complex. The input configurations should be carefully orchestrated to form end-to-end service flow paths. Second, the abstract output network behavior cannot be directly checked for correctness, and we need to generate a set of real requests that are capable of checking possible behaviors. To address these challenges, we model the service flows of traffic management in service mesh, and propose a novel Service Flow Exploration technique to enumerate all possible configuration resources and interactions between them in the input configuration. We design and implement MeshTest, which contains an automatic input configuration generator based on Service Flow Exploration and a Service Mesh Oracle which leverages formal methods to generate test request suites. MeshTest has found 23 new bugs (19 confirmed and 10 fixed) in two popular service mesh systems, Istio and Linkerd.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zheng-naiqian",
    "session_title": "Failure and Diagnosis",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "107496e0-355b-400c-99e3-6edadae12643"
  },
  {
    "title": "Preventing Network Bottlenecks: Accelerating Datacenter Services with Hotspot-Aware Placement for Compute and Storage",
    "authors": "Hamid Bazzaz,Google LLC;Weiwu Pang,University of Southern California;Yingjie Bi,Google LLC;Minlan Yu,Harvard University;Ramesh Govindan,University of Southern California;Neal Cardwell and Nandita Dukkipati,Google LLC;Meng-Jung Tsai,University of California, Los Angeles;Chris DeForeest and Yuxue Jin,Google LLC;Charles Carver,University of Colombia;Jan Kopański and Liqun Cheng,Google LLC",
    "abstract": "Datacenter network hotspots, defined as links with persistently high utilization, can lead to performance bottlenecks.In this work, we study hotspots in Google’s datacenter networks.  We find that these hotspots occur most frequently at ToR switches and can persist for hours. They are caused mainly by bandwidth demand-supply imbalance, largely due to high demand from network-intensive services, or demand exceeding available bandwidth when compute/storage upgrades outpace ToR bandwidth upgrades. Compounding this issue is bandwidth-independent task/data placement by data-center compute and storage schedulers. We quantify the performance impact of hotspots, and find that they can degrade the end-to-end latency of some distributed applications by over 2× relative to low utilization levels. Finally, we describe simple improvements we deployed. In our cluster scheduler, adding hotspot-aware task placement reduced the number of hot ToRs by 90%; in our distributed file system, adding hotspot-aware data placement reduced p95 network latency by more than 50%. While congestion control, load balancing, and traffic engineering can efficiently utilize paths for a fixed placement, we find hotspot-aware placement – placing tasks and data under ToRs with higher available bandwidth – is crucial for achieving consistently good performance.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/bazzaz",
    "session_title": "Failure and Diagnosis",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "d58a8be7-e320-49fc-a6ca-8f573e67f4db"
  },
  {
    "title": "Enhancing Network Failure Mitigation with Performance-Aware Ranking",
    "authors": "Pooria Namyar and Arvin Ghavidel,University of Southern California;Daniel Crankshaw, Daniel S. Berger, Kevin Hsieh, and Srikanth Kandula,Microsoft;Ramesh Govindan,University of Southern California;Behnaz Arzani,Microsoft",
    "abstract": "Cloud providers install mitigations to reduce the impact of network failures within their datacenters. Existing network mitigation systems rely on simple local criteria or global proxy metrics to determine the best action. In this paper, we show that we can support a broader range of actions and select more effective mitigations by directly optimizing end-to-end flow-level metrics and analyzing actions holistically. To achieve this, we develop novel techniques to quickly estimate the impact of different mitigations and rank them with high fidelity. Our results on incidents from a large cloud provider show orders of magnitude improvements in flow completion time and throughput. We also show our approach scales to large datacenters.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/namyar",
    "session_title": "Failure and Diagnosis",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "b17c2736-786c-4ecb-b299-31c2bc38b75b"
  },
  {
    "title": "One-Size-Fits-None: Understanding and Enhancing Slow Fault Tolerance in Modern Distributed Systems",
    "authors": "Ruiming Lu,University of Michigan and Shanghai Jiao Tong University;Yunchi Lu and Yuxuan Jiang,University of Michigan;Guangtao Xue,Shanghai Jiao Tong University;Peng Huang,University of Michigan",
    "abstract": "Recent studies have shown that various hardware components exhibit fail-slow behavior at scale. However, the characteristics of distributed software's tolerance of such slow faults remain ill-understood. This paper presents a comprehensive study that investigates the characteristics and current practices of slow-fault tolerance in modern distributed software. We focus on the fundamentally nuanced nature of slow faults. We develop a testing pipeline to systematically introduce diverse slow faults, measure their impact under different workloads, and identify the patterns. Our study shows that even small changes can lead to dramatically different reactions. While some systems have added slow-fault handling mechanisms, they are mostly controlled by static thresholds, which can hardly accommodate the highly sensitive and dynamic characteristics. To address this gap, we design ADR, a lightweight library to use within system code and make fail-slow handling adaptive. Evaluation shows ADR significantly reduces the impact of slow faults.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/lu",
    "session_title": "Failure and Diagnosis",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "35bb11e2-a26e-452d-b67b-667dc85a77f2"
  },
  {
    "title": "Pyrrha: Congestion-Root-Based Flow Control to Eliminate Head-of-Line Blocking in Datacenter",
    "authors": "Kexin Liu, Zhaochen Zhang, Chang Liu, and Yizhi Wang,Nanjing University;Vamsi Addanki and Stefan Schmid,TU Berlin;Qingyue Wang, Wei Chen, Xiaoliang Wang, and Jiaqi Zheng,Nanjing University;Wenhao Sun, Tao Wu, Ke Meng, Fei Chen, Weiguang Wang, and Bingyang Liu,Huawei, China;Wanchun Dou, Guihai Chen, and Chen Tian,Nanjing University",
    "abstract": "In modern datacenters, the effectiveness of end-to-end congestion control (CC) is quickly diminishing with the rapid bandwidth evolution. Per-hop flow control (FC) can react to congestion more promptly. However, a coarse-grained FC can result in Head-Of-Line (HOL) blocking. A fine-grained, per-flow FC can eliminate HOL blocking caused by flow control, however, it does not scale well. This paper presents Pyrrha, a scalable flow control approach that provably eliminates HOL blocking while using a minimum number of queues. In Pyrrha, flow control first takes effect on the root of the congestion, i.e., the port where congestion occurs. And then flows are controlled according to their contributed congestion roots. A prototype of Pyrrha is implemented on Tofino2 switches. Compared with state-of-the-art approaches, the average FCT of uncongested flows is reduced by 42%-98%, and 99th-tail latency can be 1.6×-215× lower, without compromising the performance of congested flows.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/liu-kexin",
    "session_title": "All Things Transport",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "bb1cabec-2fe3-4afb-a44b-cbee24644f52"
  },
  {
    "title": "eTran: Extensible Kernel Transport with eBPF",
    "authors": "Zhongjie Chen,Tsinghua University;Qingkai Meng,Nanjing University and Tsinghua University;ChonLam Lao,Harvard University;Yifan Liu and Fengyuan Ren,Tsinghua University;Minlan Yu,Harvard University;Yang Zhou,UC Davis and UC Berkeley",
    "abstract": "Evolving datacenters with diverse application demands are driving network transport designs. However, few have successfully landed in the widely-used kernel networking stack to benefit broader users, and they take multiple years. We present eTran, a system that makes kernel transport extensible to implement and customize diverse transport designs agilely. To achieve this, eTran leverages and extends eBPF-based techniques to customize the kernel to support complex transport functionalities safely. Meanwhile, eTran carefully absorbs user-space transport techniques for performance gain without sacrificing robust protection. We implement TCP (with DCTCP congestion control) and Homa under eTran, and achieve up to 4.8×/1.8× higher throughput with 3.7×/7.5× lower latency compared to existing kernel implementation.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/chen-zhongjie",
    "session_title": "All Things Transport",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "a9c8759a-fead-429c-a929-88b64b09eb36"
  },
  {
    "title": "White-Boxing RDMA with Packet-Granular Software Control",
    "authors": "Chenxingyu Zhao and Jaehong Min,University of Washington;Ming Liu,University of Wisconsin-Madison;Arvind Krishnamurthy,University of Washington",
    "abstract": "Driven by diverse workloads and deployments, numerous innovations emerge to customize RDMA transport, spanning congestion control, multi-tenant isolation, routing, and more. However, RDMA's hardware-offloading nature poses significant rigidity when landing these innovations. Prior workflows to deliver customizations have either waited for lengthy hardware iterations, developed bespoke hardware, or applied coarse-grained control over the black-box RDMA NIC. Despite considerable efforts, current customization workflows still lack flexibility, raw performance, and broad availability.\nIn this work, we advocate for White-Boxing RDMA, which provides control of the hardware transport to general-purpose software while preserving raw data path performance. To facilitate the white-boxing methodology, we design and implement Software-Controlled RDMA (SCR), a framework enabling packet-granular software control over the hardware transport. To address challenges stemming from granular control over high-speed line rates, SCR employs effective control models, boosts the efficiency of subsystems within the framework, and leverages emerging hardware capabilities. We implement SCR on the latest Nvidia BlueField-3 equipped with Datapath Accelerators, delivering a spectrum of new customizations not present in legacy RDMA transport, such as Multi-Tenant Fair Scheduler, User-Defined Congestion Control, Receiver-Driven Flow Control, and Multi-Path Routing Selection. Furthermore, we demonstrate SCR's applicability for GPU-Direct and NVMe-oF RDMA with zero modifications to machine learning or storage code.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zhao-chenxingyu",
    "session_title": "All Things Transport",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "a2ac3c9a-a949-4d6d-9764-31f4fd4964be"
  },
  {
    "title": "SIRD: A Sender-Informed, Receiver-Driven Datacenter Transport Protocol",
    "authors": "Konstantinos Prasopoulos,EPFL;Ryan Kosta,University of California, San Diego;Edouard Bugnion,EPFL;Marios Kogias,Imperial College London",
    "abstract": "Datacenter congestion management protocols must navigate the throughput-latency buffering trade-off in the presence of growing constraints due to switching hardware trends, oversubscribed topologies, and varying network configurability and features. In this context, receiver-driven protocols, which schedule packet transmissions instead of reacting to congestion, have shown great promise and work exceptionally well when the bottleneck lies at the ToR-to-receiver link. However, independent receiver schedules may collide if a shared link is the bottleneck instead. We present SIRD, a receiver-driven congestion control protocol designed around the simple insight that single-owner links should be scheduled while shared links should be managed through traditional congestion control algorithms. The approach achieves the best of both worlds by allowing precise control of the most common bottleneck and robust bandwidth sharing for shared bottlenecks. SIRD is implemented by end hosts and does not depend on Ethernet priorities or extensive network configuration. We compare SIRD to state-of-the-art receiver-driven protocols (Homa, dcPIM, and ExpressPass) and production-grade reactive protocols (Swift and DCTCP) and show that SIRD is the only one that can consistently maximize link utilization, minimize queuing, and obtain near-optimal latency across a wide set of workloads and traffic patterns. SIRD causes 12x less peak buffering than Homa and achieves competitive latency and utilization without requiring Ethernet priorities. Unlike dcPIM, SIRD operates without latency-inducing message exchange rounds and outperforms it in utilization, buffering, and tail latency by 9%, 43%, and 46% respectively. Finally, SIRD achieves 10x lower tail latency and 26% higher utilization than ExpressPass.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/prasopoulos",
    "session_title": "All Things Transport",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "4187cec6-a48c-4ead-a29d-a6cf1c9a8f73"
  },
  {
    "title": "Accelerating Design Space Exploration for LLM Training Systems with Multi-experiment Parallel Simulation",
    "authors": "Fei Gui,Tsinghua University;Kaihui Gao and Li Chen,Zhongguancun Laboratory;Dan Li,Tsinghua University;Vincent Liu,University of Pennsylvania;Ran Zhang and Hongbing Yang,Zhongguancun Laboratory;Dian Xiong,Tsinghua University",
    "abstract": "The rapid expansion of large language models (LLMs) requires the development of extensive GPU clusters, with companies deploying clusters with tens to hundreds of thousands of GPUs. This growth significantly expands the design space for LLM training systems, requiring thorough exploration of different parallelization strategies, communication parameters, congestion control, fabric topology, etc. Current methods require up to 10k simulation experiments to identify optimal configurations, with inadequate exploration leading to significant degradation of training performance.\nIn this paper, we tackle the overlooked problem of efficiently conducting parallel simulation experiments for design space exploration. Our analysis and experiments show that Single-process Multi-experiment (SPME) achieves superior performance by reducing scheduling overhead and optimizing resource utilization, yet remains insufficient for current AI cluster scales. To enhance SPME’s efficacy, we introduce Multiverse, a novel GPU-based AI training simulator. Multiverse leverages the computing throughput of GPUs efficiently with optimizations such as a pull-based synchronization, highfidelity intra-server communication, and a kernel-fusion technique. Extensive experiments validate the accuracy and efficiency of Multiverse, demonstrating less than 3.0% discrepancy with real-world LLM training on clusters of up to 54,000 GPUs, achieving 43.1−73.2X speedup over state-of-the-art CPU-based simulators in various use cases.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/gui",
    "session_title": "LLM Training and Resilience",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "b8ffa2a7-181e-48ad-afa8-72e58a220517"
  },
  {
    "title": "Optimizing RLHF Training for Large Language Models with Stage Fusion",
    "authors": "Yinmin Zhong, Zili Zhang, Bingyang Wu, and Shengyu Liu,School of Computer Science, Peking University;Yukun Chen, Changyi Wan, Hanpeng Hu, Lei Xia, Ranchen Ming, and Yibo Zhu,StepFun;Xin Jin,School of Computer Science, Peking University",
    "abstract": "Reinforcement Learning from Human Feedback (RLHF) enhances the alignment between LLMs and human preference. The workflow of RLHF typically involves several models and tasks in a series of distinct stages. Existing RLHF training systems view each task as the smallest execution unit thus overlooking the opportunities for subtask-level optimizations. Due to the intrinsic nature of RLHF training, i.e., the data skewness in the generation stage, and the pipeline bubbles in the training stage, existing RLHF systems suffer from low GPU utilization in production deployments. RLHFuse breaks the traditional view of RLHF workflow as a composition of individual tasks, splitting each task into finer-grained subtasks, and performing stage fusion to improve GPU utilization. RLHFuse contains two key ideas. First, for generation and inference tasks, RLHFuse splits them into sample-level subtasks, enabling efficient inter-stage fusion to mitigate the original generation bottleneck dominated by long-tailed samples. Second, for training tasks, RLHFuse breaks them into subtasks of micro-batches. By leveraging the intuition that pipeline execution can be essentially complemented by another pipeline, RLHFuse performs intra-stage fusion to concurrently execute these subtasks in the training stage with a fused pipeline schedule, resulting in fewer pipeline bubbles. In addition, RLHFuse incorporates a series of system optimizations tailored for each stage of RLHF, making it efficient and scalable for our internal product usage. We evaluate RLHFuse on various popular LLMs and the results show that RLHFuse increases the training throughput by up to 3.7x, compared to existing state-of-the-art systems.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zhong",
    "session_title": "LLM Training and Resilience",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "740a59ec-71a9-413b-bfd9-ce981539f2c8"
  },
  {
    "title": "Minder: Faulty Machine Detection for Large-scale Distributed Model Training",
    "authors": "Yangtao Deng,Tsinghua University;Xiang Shi and Zhuo Jiang,ByteDance;Xingjian Zhang,Tsinghua University;Lei Zhang, Zhang Zhang, Bo Li, Zuquan Song, Hang Zhu, and Gaohong Liu,ByteDance;Fuliang Li,Northeastern University;Shuguang Wang, Haibin Lin, and Jianxi Ye,ByteDance;Minlan Yu,Harvard University",
    "abstract": "Large-scale distributed model training requires simultaneous training on up to thousands of machines. Faulty machine detection is critical when an unexpected fault occurs in a machine. From our experience, a training task can encounter two faults per day on average, possibly leading to a halt for hours. To address the drawbacks of the time-consuming and labor-intensive manual scrutiny, we propose Minder, an automatic faulty machine detector for distributed training tasks. The key idea of Minder is to automatically and efficiently detect faulty distinctive monitoring metric patterns, which could last for a period before the entire training task comes to a halt. Minder has been deployed in our production environment for over one year, monitoring daily distributed training tasks where each involves up to thousands of machines. In our real-world fault detection scenarios, Minder can accurately and efficiently react to faults within 3.6 seconds on average, with a precision of 0.904 and F1-score of 0.893.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/deng",
    "session_title": "LLM Training and Resilience",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "8837e4f8-f858-4c4e-9d02-7c3360f7f2f1"
  },
  {
    "title": "Holmes: Localizing Irregularities in LLM Training with Mega-scale GPU Clusters",
    "authors": "Zhiyi Yao and Pengbo Hu,Fudan University;CongCongMiao and Xuya Jia,Tencent;Zuning Liang and Yuedong Xu,Fudan University;Chunzhi He, Hao Lu, Mingzhuo Chen, Xiang Li, Zekun He, Yachen Wang, and Xianneng Zou,Tencent;Junchen Jiang,University of Chicago",
    "abstract": "Training Large Language Models (LLMs) on large-scale GPU clusters requires numerous iterations over several months. Existing works mainly focus on addressing failures that interrupt the iterative training process to improve the utilization of GPU clusters. However, our large-scale measurements over tens of thousands of GPUs show that the training process exhibits an unstable state with some irregular iterations taking even more than twice the time of a normal iteration. Surprisingly, we find that these irregular iterations greatly extend the time of LLM training, which is even more severe than the impact of failures. Meanwhile, the irregular phenomenon is silent, making it challenging to be accurately localized. In this paper, we propose a first-of-its-kind system called Holmes, leveraging communication operators to accurately localize these irregularities in real-time. The core of Holmes's approach is to employ an enhanced abnormal operator detection model and a novel communication operator graph to perform efficient irregularity localization. Furthermore, Holmes conducts cross-iteration analysis to improve localization accuracy. We evaluate Holmes using large-scale trace-driven simulations and a production-level prototype.  Large-scale simulation results demonstrate that Holmes achieves irregularity localization accuracy of 97.21%. Production-level prototype evaluation results show Holmes can localize irregularity within 30.3 seconds, achieving a speedup of 6.52× as compared to traditional approaches.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/yao",
    "session_title": "LLM Training and Resilience",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "b57ea44d-5e7c-4b04-9ca5-b1843be6918d"
  },
  {
    "title": "SimAI: Unifying Architecture Design and Performance Tunning for Large-Scale Large Language Model Training with Scalability and Precision",
    "authors": "Xizheng Wang,Alibaba Cloud and Tsinghua University;Qingxu Li, Yichi Xu, and Gang Lu,Alibaba Cloud;Dan Li,Tsinghua University;Li Chen,Zhongguancun Laboratory;Heyang Zhou,Alibaba Cloud;Linkang Zheng,Alibaba Cloud and South China University of Technology;Sen Zhang, Yikai Zhu, Yang Liu, Pengcheng Zhang, Kun Qian, Kunling He, Jiaqi Gao, and Ennan Zhai,Alibaba Cloud;Dennis Cai,Alibaba Group;Binzhang Fu,Alibaba Cloud",
    "abstract": "The large number of GPUs required for a single LLM training significantly hinders the validation of new designs, tunings, and optimizations, calling for the occurrence of efficient simulators. Existing simulators, however, only target a specific granularity of the entire training, intrinsically leading to imprecision. This paper presents SimAI, a unified simulator aiming at precisely and efficiently simulating the LLM training procedure at scale. Through selective and high-fidelity integration of the training frameworks, the kernel computation, and the collective communication library into the simulating procedure, SimAI achieves high precision in simulations. SimAI further conducts multi-thread acceleration and implements lock-free global context-sharing to accelerate the execution speed. The effectiveness of SimAI is validated by its performance results, which show an average of 98.1% alignment to real-world results under various test scenarios and affirm its robustness and adaptability from small-scale labs to large-scale industrial environments. SimAI delivers meaningful guidelines for new host designs and parameter settings, directly benefiting in-production LLM training. We also share experiences and lessons learned during the evolution of SimAI. SimAI is open sourced athttps://github.com/aliyun/SimAI.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wang-xizheng-simai",
    "session_title": "LLM Training and Resilience",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "b739364b-e7aa-407c-b6e5-452706742a44"
  },
  {
    "title": "BCP: A Unified Checkpointing System for Large Foundation Model Development",
    "authors": "Borui Wan,The University of Hong Kong;Mingji Han, Yiyao Sheng, Yanghua Peng, Haibin Lin, Mofan Zhang, Zhichao Lai, Menghan Yu, Junda Zhang, Zuquan Song, and Xin Liu,ByteDance Inc.;Chuan Wu,The University of Hong Kong",
    "abstract": "Checkpointing to preserve training states is crucial during the development of Large Foundation Models (LFMs), for training resumption upon various failures or changes in GPU resources and parallelism configurations. In addition, saved checkpoints are dispatched to evaluation tasks or transferred across different training stages (e.g., from pre-training to post-training). All these scenarios require resharding distributed checkpoints from one parallelism to another. In production environments, different LFMs are trained with various frameworks and storage backends, depending on model sizes and training scales. A high-performance checkpointing system is needed to enable efficient checkpoint management at scale throughout the lifecycle of LFM development. We introduce ByteCheckpoint, an industrial-grade checkpointing system for large-scale LFM training. ByteCheckpoint features: a parallelism-agnostic checkpoint representation that enables efficient load-time checkpoint resharding; a generic checkpoint saving/loading workflow to accommodate multiple training frameworks and support different storage backends; full-stack optimizations to ensure high I/O efficiency and scalability; a suite of monitoring tools to streamline large-scale performance analysis and bottleneck detection. Compared to existing open-source checkpointing systems [52, 58], ByteCheckpoint significantly reduces runtime checkpoint stalls, achieving an average reduction of 54.20x. For saving and loading times, ByteCheckpoint achieves improvements of up to 9.96x and 8.80x, respectively.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wan-borui",
    "session_title": "LLM Training and Resilience",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "04569f6d-5deb-49f4-a428-8ef26c289224"
  },
  {
    "title": "Mowgli: A Passive Approach to Learning Real-Time Rate Control for Video Conferencing",
    "authors": "Neil Agarwal and Rui Pan,Princeton University;Francis Y. Yan,Microsoft Research and UIUC;Ravi Netravali,Princeton University",
    "abstract": "Rate control algorithms are at the heart of video conferencing platforms, determining target bitrates that match dynamic network characteristics for high quality. Recent data-driven strategies have shown promise for this challenging task, but the performance degradation they introduce during training has been a nonstarter for many production services, precluding adoption. This paper aims to bolster the practicality of data-driven rate control by presenting an alternative avenue for experiential learning: leveraging purely existing telemetry logs produced by the incumbent algorithm in production. We observe that these logs contain effective decisions, although often at the wrong times or in the wrong order. To realize this approach despite the inherent uncertainty that log-based learning brings (i.e., lack of feedback for new decisions), our system, Mowgli, combines a variety of robust learning techniques (i.e., conservatively reasoning about alternate behavior to minimize risk and using a richer model formulation to account for environmental noise). Across diverse networks (emulated and real-world), Mowgli outperforms the widely deployed GCC algorithm, increasing average video bitrates by 15-39% while reducing freeze rates by 60-100%.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/agarwal",
    "session_title": "Video and Cloud Gaming",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "dec1a4dc-4230-4bdb-8153-e17b8604d26c"
  },
  {
    "title": "Dissecting and Streamlining the Interactive Loop of Mobile Cloud Gaming",
    "authors": "Yang Li, Jiaxing Qiu, Hongyi Wang, and Zhenhua Li,Tsinghua University;Feng Qian,University of Southern California;Jing Yang,Tsinghua University;Hao Lin,Tsinghua University and University of Illinois Urbana-Champaign;Yunhao Liu,Tsinghua University;Bo Xiao and Xiaokang Qin,Ant Group;Tianyin Xu,University of Illinois Urbana-Champaign",
    "abstract": "With cloud-side computing and rendering, mobile cloud gaming (MCG) is expected to deliver high-quality gaming experiences to budget mobile devices. However, our measurement on representative MCG platforms reveals that even under good network conditions, all platforms exhibit high interactive latency of 112–403 ms, from a user-input action to its display response, that critically affects users’ quality of experience. Moreover, jitters in network latency often lead to significant fluctuations in interactive latency.\nIn this work, we collaborate with a commercial MCG platform to conduct the first in-depth analysis on the interactive latency of cloud gaming. We identify VSync, the synchronization primitive of Android graphics pipeline, to be a key contributor to the excessive interactive latency; as many as five VSync events are intricately invoked, which serialize the complex graphics processing logic on both the client and cloud sides. To address this, we design an end-to-end VSync regulator, dubbed LoopTailor, which minimizes VSync events by decoupling game rendering from the lengthy cloud-side graphics pipeline and coordinating cloud game rendering directly with the client. We implement LoopTailor on the collaborated platform and commodity Android devices, reducing the interactive latency (by ∼34%) to stably below 100 ms.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/li-yang",
    "session_title": "Video and Cloud Gaming",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "e7162240-3586-4486-9113-16965602b756"
  },
  {
    "title": "Region-based Content Enhancement for Efﬁcient Video Analytics at the Edge",
    "authors": "Weijun Wang,Institute for AI Industry Research (AIR), Tsinghua University;Liang Mi, Shaowei Cen, and Haipeng Dai,State Key Laboratory for Novel Software Technology, Nanjing University;Yuanchun Li,Institute for AI Industry Research (AIR), Tsinghua University;Xiaoming Fu,University of Göttingen;Yunxin Liu,Institute for AI Industry Research (AIR), Tsinghua University",
    "abstract": "Video analytics is widespread in various applications serving our society. Recent advances of content enhancement in video analytics offer signiﬁcant beneﬁts for the bandwidth saving and accuracy improvement. However, existing content-enhanced video analytics systems are excessively computationally expensive and provide extremely low throughput. In this paper, we present region-based content enhancement, that enhances only the important regions in videos, to improve analytical accuracy. Our system, RegenHance, enables high-accuracy and high-throughput video analytics at the edge by 1) a macroblock-based region importance predictor that identifies the important regions fast and precisely, 2) a regionaware enhancer that stitches sparsely distributed regions into dense tensors and enhances them efﬁciently, and 3) a proﬁle-based execution planer that allocates appropriate resources for enhancement and analytics components. We prototype RegenHance on ﬁve heterogeneous edge devices. Experiments on two analytical tasks reveal that region-based enhancement improves the overall accuracy of 10-19% and achieves 2-3× throughput compared to the state-of-the-art frame-based enhancement methods.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wang-weijun",
    "session_title": "Video and Cloud Gaming",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "c5390dda-6bd2-4020-b496-ad9e6f4c6d0a"
  },
  {
    "title": "Tooth: Toward Optimal Balance of Video QoE and Redundancy Cost by Fine-Grained FEC in Cloud Gaming Streaming",
    "authors": "Congkai An, Huanhuan Zhang, Shibo Wang, Jingyang Kang, Anfu Zhou, and Liang Liu,Beijing University of Posts and Telecommunications;Huadong Ma,Beijing University of Posts and Telecommunications (China);Zili Meng,HKUST;Delei Ma, Yusheng Dong, and Xiaogang Lei,Well-Link Times Inc.",
    "abstract": "Despite the rapid rise of cloud gaming, real-world evaluations of its quality of experience (QoE) remain scarce. To fill this gap, we conduct a large-scale measurement campaign, analyzing over 60,000 sessions on an operational cloud gaming platform. We find that current cloud gaming streaming suffers from substantial bandwidth wastage and severe interaction stalls simultaneously. In-depth investigation reveals the underlying reason, i.e., existing streaming adopts coarse-grained Forward Error Correction (FEC) encoding, without considering the adverse impact of frame length variation, which results in over-protection of large frames (i.e., bandwidth waste) and under-protection of smaller ones (i.e., interaction stalls). To remedy the problem, we propose Tooth, a per-frame adaptive FEC that aims to achieve the optimal balance between satisfactory QoE and efficient bandwidth usage. To build Tooth, we design a dual-module FEC encoding strategy, which takes full consideration of both frame length variation and network dynamics, and hence determines an appropriate FEC redundancy rate for each frame. Moreover, we also circumvent the formidable per-frame FEC computational overhead by designing a lightweight Tooth, so as to meet the rigid latency bound of real-time cloud gaming. We implement, deploy, and evaluate Tooth in the operational cloud gaming system. Extensive field tests demonstrate that Tooth significantly outperforms existing state-of-the-art FEC methods, reducing stall rates by 40.2% to 85.2%, enhancing video bitrates by 11.4% to 29.2%, and lowering bandwidth costs by 54.9% to 75.0%.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/an",
    "session_title": "Video and Cloud Gaming",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "3460c53c-e6ee-465a-b3d4-c9d25cdd5f3c"
  },
  {
    "title": "AsTree: An Audio Subscription Architecture Enabling Massive-Scale Multi-Party Conferencing",
    "authors": "Tong Meng, Wenfeng Li, Chao Yuan, Changqing Yan, and Le Zhang,ByteDance Inc.",
    "abstract": "While operating a multi-party video conferencing system (Lark) globally, we find that audio subscription alone may pose considerable challenges to the network, especially when scaling towards massive scales. Traditional strategy of subscribing to all remote participants suffers from issues such as signaling storm, excessive bandwidth and resource consumption on both server and client sides. Aimed at enhanced scalability, we share our design of AsTree, an audio subscription architecture. By a cascading tree topology and media plane-based audio selection, AsTree dramatically reduces the number of signaling messages and audio streams to forward. Practical deployment in Lark reduces audio and video stall ratios by more than 30% and 50%. We also receive 40% less negative client reviews, strongly proving the value of AsTree.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/meng",
    "session_title": "Video and Cloud Gaming",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "a24d7739-55c4-4d0a-9f42-e1c1521254d7"
  },
  {
    "title": "AutoCCL: Automated Collective Communication Tuning for Accelerating Distributed and Parallel DNN Training",
    "authors": "Guanbin Xu, Zhihao Le, Yinhe Chen, Zhiqi Lin, and Zewen Jin,University of Science and Technology of China;Youshan Miao,Microsoft;Cheng Li,University of Science and Technology of China",
    "abstract": "The collective communication libraries are pivotal in optimizing the performance of distributed and parallel deep neural network (DNN) training. Most network optimizations are under the assumption that these libraries are well-tuned, ignoring their low-level parameter selection. In this paper, we present a novel automated tuning method AutoCCL that significantly improves communication performance without incurring additional costs. One of the primary challenges we tackle is the state explosion in searching for the optimal configuration. To overcome this, we decouple implementation-related parameters from those sensitive to the search space size and propose a divide-and-conquer algorithm, minimizing the requirement for exhaustive trials. We further propose an online tuning approach that accounts for communication-computation interference to enhance accuracy in finding optimal configurations, while hiding tuning overhead within early iterations of training jobs. We implement AutoCCL atop NCCL, a leading and widely-used communication library provided by NVIDIA. Our evaluation on both a 2-node cluster (16 A40 GPUs, intra-node NVLink, inter-node 2× 400Gbps InfiniBand) and a 4-node cluster (32 A40 GPUs, intra-node PCIe, inter-node 100Gbps InfiniBand) demonstrates that AutoCCL achieves 1.24-1.29× and 1.15-1.22× speedups on microbenchmarks compared to NCCL and another SOTA NCCL tuner, respectively, and up to 1.80× and 1.49× with concurrent computation. End-to-end evaluations on three large language models and one vision model show 1.07-1.32× improvements in periteration training time.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/xu-guanbin",
    "session_title": "Infra For ML",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "d900e95e-3270-4b73-a50b-f6f71fa29194"
  },
  {
    "title": "OptiReduce: Resilient and Tail-Optimal AllReduce for Distributed Deep Learning in the Cloud",
    "authors": "Ertza Warraich,Purdue University;Omer Shabtai and Khalid Manaa,NVIDIA;Shay Vargaftik,VMware Research;Yonatan Piasetzky and Matty Kadosh,NVIDIA;Lalith Suresh,Feldera;Muhammad Shahbaz,Purdue University",
    "abstract": "We present Ultima, a new collective-communication system for the cloud with bounded, predictable completion times for deep-learning jobs in the presence of varying computation (stragglers) and communication (congestion and gradient drops) variabilities. Ultima exploits the inherent resiliency and the stochastic nature of distributed deep-learning (DDL) training to work with approximated gradients, and provides an efficient balance between (tail) performance and the resulting accuracy of the trained models. Exploiting this domain-specific characteristic of DDL, Ultima introduces (1) mechanisms (e.g., Transpose AllReduce, unreliable connection-oriented transport, and adaptive timeout) to improve the DDL jobs' tail execution time, and (2) strategies (e.g., Hadamard Transform) to mitigate the impact of gradient drops on model accuracy. Our evaluation shows that Ultima achieves 60% faster time-to-accuracy (TTA), on average, when operating in shared environments (e.g., public cloud), and is on par with existing algorithms (e.g., Ring-AllReduce) in dedicated environments (like HPC).",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/warraich",
    "session_title": "Infra For ML",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "81e66998-ab8d-40c5-9623-5f371ad6adc2"
  },
  {
    "title": "Efficient Direct-Connect Topologies for Collective Communications",
    "authors": "Liangyu Zhao,University of Washington;Siddharth Pal,Raytheon BBN Technologies;Tapan Chugh,University of Washington;Weiyang Wang,MIT CSAIL;Jason Fantl, Prithwish Basu, and Joud Khoury,Raytheon BBN Technologies;Arvind Krishnamurthy,University of Washington",
    "abstract": "We consider the problem of distilling efficient network topologies for collective communications. We provide an algorithmic framework for constructing direct-connect topologies optimized for the latency vs. bandwidth trade-off associated with the workload. Our approach synthesizes many different topologies and communication schedules for a given cluster size and degree, then identifies the best option for a given workload. Our algorithms start from small, optimal base topologies and associated schedules, using techniques that can be iteratively applied to derive much larger topologies and schedules. Additionally, we incorporate well-studied large-scale graph topologies into our algorithmic framework by producing efficient communication schedules for them using a novel polynomial-time algorithm. Our evaluation uses multiple testbeds and large-scale simulations to demonstrate significant performance benefits from our derived topologies and schedules.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zhao-liangyu",
    "session_title": "Infra For ML",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "48daa219-3d8d-45e6-883b-a8c13d9decb2"
  },
  {
    "title": "SuperServe: Fine-Grained Inference Serving for Unpredictable Workloads",
    "authors": "Alind Khare and Dhruv Garg,Georgia Institute of Technology;Sukrit Kalra,UC Berkeley;Snigdha Grandhi,Adobe;Ion Stoica,UC Berkeley;Alexey Tumanov,Georgia Institute of Technology",
    "abstract": "The increasing deployment of ML models on the critical path of production applications requires ML inference serving systems to serve these models under unpredictable and bursty request arrival rates. Serving many models under such conditions requires a careful balance between each application’s latency and accuracy requirements and the overall efficiency of utilization of scarce resources. Faced with this tension, state-of-the-art systems either choose a single model representing a static point in the latency-accuracy tradeoff space to serve all requests or incur latency target violations by loading specific models on the critical path of request serving. Our work instead resolves this tension through a resource-efficient serving of the entire range of models spanning the latency-accuracy tradeoff space. Our novel mechanism, SubNetAct, achieves this by carefully inserting specialized control-flow operators in pre-trained, weight-shared super-networks. These operators enable SubNetAct to dynamically route a request through the network to actuate a specific model that meets the request’s latency and accuracy target. Thus, SubNetAct can serve a vastly higher number of models than prior systems while requiring upto 2.6× lower memory. More crucially, SubNetAct’s near-instantaneous actuation of a wide-range of models unlocks the design space of fine-grained, reactive scheduling policies. We design one such extremely effective policy, SlackFit, and instantiate both SubNetAct and SlackFit in a real system, SuperServe. On real-world traces derived from a Microsoft workload, SuperServe achieves 4.67% higher accuracy for the same latency targets and 2.85× higher latency target attainment for the same accuracy.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/khare",
    "session_title": "Infra For ML",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "cb537563-144a-494b-8f1e-ef5dfdc288d9"
  },
  {
    "title": "Pineapple: Unifying Multi-Paxos and Atomic Shared Registers",
    "authors": "Tigran Bantikyan,Northwestern;Jonathan Zarnstorff,unaffiliated;Te-Yen Chou,CMU;Lewis Tseng,UMass Lowell;Roberto Palmieri,Lehigh University",
    "abstract": "Linearizable storage systems reduce the complexity of developing correct large-scale customer-facing applications, in the presence of concurrent operations and failures. A common approach for providing linearizability is to use consensus to order operations invoked by applications. This paper explores designs that offload operations (from the consensus component) to improve overall performance.\nThis paper presents Pineapple, which uses logical timestamps to unify Multi-Paxos and atomic shared registers so that any node in the system can serve read and write operations. Compared to Multi-Paxos (or leader-based consensus), Pineapple reduces bottlenecks at the leader. Compared to Gryff, which unifies EPaxos and atomic shared registers, Pineapple has better performance because Pineapple has “non-blocking operation execution.”\nOur evaluation shows that Pineapple improves both throughput and tail latency, compared to state-of-the-art systems (e.g., Gryff, Multi-Paxos, EPaxos), in both wide-area networks and local-area networks. We also integrate Pineapple with etcd. In a balanced workload, Pineapple reduces median latency by more than 50%, compared to the original system that uses an optimized version of Raft.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/bantikyan",
    "session_title": "Fast Scalable Consensus",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "5907d61c-5a4f-4f62-b702-124756cbaf4e"
  },
  {
    "title": "Ladder: A Convergence-based Structured DAG Blockchain for High Throughput and Low Latency",
    "authors": "Dengcheng Hu,Tianjin University;Jianrong Wang,School of Computer Science and Technology, College of Intelligence and Computing, Tianjin University;Xiulong Liu and Hao Xu,Tianjin University;Xujing Wu,Jd.Com, Inc;Muhammad Shahzad,Department of Computer Science, North Carolina State University, Raleigh, NC, USA;Guyue Liu,Peking University;Keqiu Li,Tianjin University",
    "abstract": "Recent literature proposes the use of Directed Acyclic Graphs (DAG) to enhance blockchain performance. However, current block-DAG designs face three important limitations when fully utilizing parallel block processing: high computational overhead due to costly block sorting, complex transaction confirmation process, and vulnerability to balance attacks when determining the pivot chain. To this end, we propose Ladder, a structured twin-chain DAG blockchain with a convergence mechanism that efficiently optimizes parallel block processing strategy and enhances overall performance and security. In each round, a designated convergence node generates a lower-chain block, sorting the forked blocks from the upper-chain, reducing computational overhead and simplifying transaction confirmation.To counter potential adversarial disruptions, a dynamic committee is selected to generate special blocks when faulty blocks are detected. We implemented and evaluated Ladder in a distributed network environment against several state-of-the-art methods. Our results show that Ladder achieves a 59.6% increase in throughput and a 20.9% reduction in latency.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/hu",
    "session_title": "Fast Scalable Consensus",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "eff960d3-9959-44bb-8e82-2ddd49b50aa1"
  },
  {
    "title": "Vegeta: Enabling Parallel Smart Contract Execution in Leaderless Blockchains",
    "authors": "Tianjing Xu, Yongqi Zhong, and Shengyun Liu,Shanghai Jiao Tong University;Ruofan Xiong,Xiamen University;Jingjing Zhang,Fudan University;Yiming Zhang,Shanghai Jiao Tong University",
    "abstract": "Consensus and smart contract execution play complementary roles in blockchain systems. Leaderless consensus, as a promising direction in the blockchain context, can better utilize the resources of each node and/or avoid incurring the extra burden of timing assumptions. As modern Byzantine-Fault Tolerant (BFT) consensus protocols can order several hundred thousand transactions per second, contract execution is becoming the performance bottleneck. Adding concurrency to contract execution is a natural way to boost its performance, but none of the existing frameworks is a perfect fit for leaderless consensus.\nWe propose speculate-order-replay, a generic framework tailored to leaderless consensus protocols. Our framework allows each proposer to (pre-)process transactions prior to consensus, better utilizing its computing resources. We instantiate the framework with a concrete concurrency control protocol Vegeta. Vegeta speculatively executes a series of transactions and analyzes their dependencies before consensus, and later deterministically replays the schedule. We ran experiments under the real-world Ethereum workload on 16vCPU virtual machines. Our evaluation results show that Vegeta achieved up to 7.8× speedup compared to serial execution. When deployed on top of a leaderless consensus protocol with 10 nodes, Vegeta still achieved 6.9× speedup.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/xu-tianjing",
    "session_title": "Fast Scalable Consensus",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "bbe5d58c-7ad9-493a-9d4e-4452f7975050"
  },
  {
    "title": "Bolt: High Throughput DAG BFT Can Be Fast and Robust!",
    "authors": "Balaji Arun and Zekun Li,Aptos Labs;Florian Suri-Payer,Cornell University;Sourav Das,UIUS;Alexander Spiegelman,Aptos Labs",
    "abstract": "Today's practical partially synchronous Byzantine Fault Tolerant consensus protocols trade off low latency and high throughput. On the one end, traditional BFT protocols such as PBFT and its derivatives optimize for latency. They require, in fault-free executions, only 3 message delays to commit, the optimum for BFT consensus. However, this class of protocols typically relies on a single leader, hampering throughput scalability. On the other end, a new class of so-called DAG-BFT protocols demonstrates how to achieve highly scalable throughput by separating data dissemination from consensus, and using every replica as proposer. Unfortunately, existing DAG-BFT protocols pay a steep latency premium, requiring on average 10.5 message delays to commit transactions.\nThis work aims to soften this tension, and proposes Shoal++, a novel DAG-based BFT consensus system that offers the throughput of DAGs while reducing end-to-end consensus commit latency to an average of 4.5 message delays. Our empirical findings are encouraging, showing that Shoal++ achieves throughput comparable to state-of-the-art DAG BFT solutions while reducing latency by up to 60%, even under less favorable network and failure conditions.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/arun",
    "session_title": "Fast Scalable Consensus",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "c7a3f0ab-0abc-485c-91dc-ff67f157e8f0"
  },
  {
    "title": "Learning Production-Optimized Congestion Control Selection for Alibaba Cloud CDN (Operational Systems Track)",
    "authors": "Xuan Zeng,Alibaba Cloud;Haoran Xu,Sun Yat-sen University;Yubing Qiu and Xumiao Zhang,Alibaba Cloud;Xiaoxi Zhang,Sun Yat-sen University;Chen Chen, Yiping Zhang, and Ennan Zhai,Alibaba Cloud",
    "abstract": "Today's content delivery networks (CDNs) typically use static congestion control (CC) configurations, yet the diverse network environments preclude a universally optimal CC for all geographical regions, as evidenced by our extensive measurements. Current CC algorithms, limited by narrow applicability or high maintenance costs, struggle in large-scale CDNs. This work introduces AliCCS, the first CC Selection (CCS) approach tailored for production CDN, integrating fine-grained domain knowledge for learning to choose the best CC from existing, well-established ones. Through an over-one-year real-world deployment in Alibaba Cloud CDN, AliCCS has enhanced the Quality-of-Experience (QoE) by up to 9.31%, surpassing the competitive margin in the CDN market, and significantly reduced the retransmission rate by 25.51% to 174.36% across all provinces of China, leading to cost savings over 10 million US dollars. We also share key insights and experiences from deploying AliCCS at scale, highlighting traffic patterns in Alibaba Cloud CDN.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zeng",
    "session_title": "Operational Experiences",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "2ea51a4b-3b69-4388-b135-68fdbb7638c1"
  },
  {
    "title": "GPU-Disaggregated Serving for Deep Learning Recommendation Models at Scale",
    "authors": "Lingyun Yang,Hong Kong University of Science and Technology;Yongchen Wang and Yinghao Yu,Alibaba Group;Qizhen Weng,Hong Kong University of Science and Technology;Jianbo Dong, Kan Liu, Chi Zhang, Yanyi Zi, Hao Li, Zechao Zhang, Nan Wang, Yu Dong, Menglei Zheng, Lanlan Xi, Xiaowei Lu, Liang Ye, Guodong Yang, Binzhang Fu, Tao Lan, Liping Zhang, and Lin Qu,Alibaba Group;Wei Wang,Hong Kong University of Science and Technology",
    "abstract": "Online recommender systems use deep learning recommendation models (DLRMs) to provide accurate, personalized recommendations to improve customer experience. However, efficiently provisioning DLRM services at scale is challenging. DLRMs exhibit distinct resource usage patterns: they require a large number of CPU cores and a tremendous amount of memory, but only a small number of GPUs. Running them in multi-GPU servers quickly exhausts the servers' CPU and memory resources, leaving a large number of unallocated GPUs stranded, unable to utilize by other tasks.\nThis paper describes Prism, a production DLRM serving system that eliminates GPU fragmentation by means of resource disaggregation. In Prism, a fleet of CPU nodes (CNs) interconnect with a cluster of heterogeneous GPU nodes (HNs) through RDMA, leading to two disaggregated resource pools that can independently scale. Prism automatically divides DLRMs into CPU- and GPU-intensive subgraphs and schedules them on CNs and HNs for disaggregated serving. Prism employs various techniques to minimize the latency overhead caused by disaggregation, including optimal graph partitioning, topology-aware resource management, and SLO-aware communication scheduling. Evaluations show that Prism effectively reduces CPU and GPU fragmentation by 53% and 27% in a crowded GPU cluster. During seasonal promotion events, it efficiently enables capacity loaning from training clusters, saving over 90% of GPUs. Prism has been deployed in production clusters for over two years and now runs on over 10k GPUs.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/yang",
    "session_title": "Operational Experiences",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "6abe4ca5-0e22-4164-9809-def21a2bf531"
  },
  {
    "title": "Evolution of Aegis: Fault Diagnosis for AI Model Training Cloud Service in Production (Experience Track)",
    "authors": "Jianbo Dong, Kun Qian, Pengcheng Zhang, Zhilong Zheng, Liang Chen, Fei Feng, Yikai Zhu, Gang Lu, Zhihui Ren, Xue Li, Zhicheng Wang, Bin Luo, Shuai Peng, Yang Liu, Yichi Xu, Yanqing Chen, Yu Guan, Weicheng Wang, Hanyu Zhao, Xianlong Zeng, Zhiping Yao, Ennan Zhai, Binzhang Fu, and Dennis Cai,Alibaba Cloud",
    "abstract": "Despite the success of diagnosis systems in traditional cloud computing, these systems are not suitable for pinpointing faults in AI model training cloud scenarios due to the differences in computing paradigms between traditional cloud computing and model training. As one of the largest cloud providers, we present Aegis, a fault diagnosis system specifically designed for AI model training service. We share our experience in the motivation, design, and evolution of Aegis. Keeping easy-to-deploy as the primary principle, Aegis Phase- 1 started by enhancing existing general-purpose diagnosis systems. After several months of evolution, Aegis Phase-2 cogitatively chose to customize the collective communication library for sophisticated failure localization in runtime without modifying customer code. Besides the failure localization, we further equipped Aegis with the capabilities on handling performance degradation and failure checking before delivery. Aegis has been deployed in our production training cloud service for one year. Aegis decreases more than 97% of the idle time wasted by diagnosis, 84% of the training task restart count and 71% of the performance degradation.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/dong",
    "session_title": "Operational Experiences",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "20a7a38f-39ba-4105-bf40-f0092c875493"
  },
  {
    "title": "The Papaya Federated Analytics Stack: Engineering Privacy, Scalability and Practicality",
    "authors": "Harish Srinivas, Graham Cormode, Mehrdad Honarkhah, Sam Lurye, Jonathan Hehir, Lunwen He, George Hong, and Ahmed Magdy,Meta;Dzmitry Huba,Google;Kaikai Wang, Shen Guo, and Shoubhik Bhattacharya,Meta",
    "abstract": "Cross-device Federated Analytics (FA) is a distributed computation paradigm designed to answer analytics queries about and derive insights from data held locally on users' devices. On-device computations combined with other privacy and security measures ensure that only minimal data is transmitted off-device, achieving a high standard of data protection. Despite FA's broad relevance, the applicability of existing FA systems is limited by compromised accuracy; lack of flexibility for data analytics; and an inability to scale effectively. In this paper, we describe our approach to combine privacy, scalability, and practicality to build and deploy a system that overcomes these limitations. Our FA system leverages trusted execution environments (TEEs) and optimizes the use of on-device computing resources to facilitate federated data processing across large fleets of devices, while ensuring robust, defensible, and verifiable privacy safeguards. We focus on federated analytics (statistics and monitoring), in contrast to systems for federated learning (ML workloads), and we flag the key differences.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/srinivas",
    "session_title": "Operational Experiences",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "4a30364a-edea-4720-84bd-0e5855a5304d"
  },
  {
    "title": "HA/TCP: A Reliable and Scalable Framework for TCP Network Functions",
    "authors": "Haoyu Gu, Ali José Mashtizadeh, and Bernard Wong,University of Waterloo",
    "abstract": "Layer 7 network functions (NFs) are a critical piece of modern network infrastructure. As a result, the scalability and reliability of these NFs are important but challenging because of the complexity of layer 7 NFs. This paper presents HA/TCP, a framework that enables migration and failover of layer 7 NFs. HA/TCP uses a novel replication mechanism to synchronize the state between replicas with low overhead, enabling seamless migration and failover of TCP connections. HA/TCP encapsulates the implementation details into our replicated socket interface to allow developers to easily add high availability to their layer 7 NFs such as WAN accelerators, load balancers, and proxies. Our benchmarks show that HA/TCP provides reliability for a 100 Gbps NF with as little as 0.2% decrease in client throughput. HA/TCP transparently migrates a connection between replicas in 38 µs, including the network latency. We provide reliability to a SOCKS proxy and a WAN accelerator with less than 2% decrease in throughput and a modest increase in CPU usage.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/gu",
    "session_title": "Middleboxes",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "be46c425-2b5d-437a-b4cf-f38770a8a963"
  },
  {
    "title": "High-level Programming for Application Networks",
    "authors": "Xiangfeng Zhu and Yuyao Wang,University of Washington;Banruo Liu,UIUC;Yongtong Wu,Peking University;Nikola Bojanic,University of Washington;Jingrong Chen,Duke University;Gilbert Bernstein and Arvind Krishnamurthy,University of Washington;Sam Kumar,University of Washington and University of California, Los Angeles;Ratul Mahajan,University of Washington;Danyang Zhuo,Duke University",
    "abstract": "Application networks facilitate communication between the microservices of cloud applications. They are built today using service meshes with low-level specifications that make it difficult to express application-specific functionality (e.g., access control based on RPC fields),  and they can more than double the RPC latency. We develop AppNet, a framework that makes it easy to build expressive and high-performance application networks. Developers specify rich RPC processing in a high-level language with generalized match-action rules and built-in state management. We compile the specifications to high-performance code after optimizing where (e.g., client, server) and how (e.g., RPC library, proxy)  each RPC processing element runs. The optimization uses symbolic abstraction and execution to judge if different runtime configurations of possibly-stateful RPC processing elements are semantically equivalent for arbitrary RPC streams. Our experiments show that AppNet can express common application network function in only 7-28 lines of code. Its optimizations lower RPC processing latency by up to 82%.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zhu",
    "session_title": "Middleboxes",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "77f1b2f6-1597-424e-a7c0-f2fb8c11e3eb"
  },
  {
    "title": "State-Compute Replication: Parallelizing High-Speed Stateful Packet Processing",
    "authors": "Qiongwen Xu,Rutgers University;Sebastiano Miano,Politecnico di Milano;Xiangyu Gao and Tao Wang,New York University;Adithya Murugadass and Songyuan Zhang,Rutgers University;Anirudh Sivaraman,New York University;Gianni Antichi,Queen Mary University of London and Politecnico di Milano;Srinivas Narayana,Rutgers University",
    "abstract": "With the slowdown of Moore’s law, CPU-oriented packet processing in software will be significantly outpaced by emerging line speeds of network interface cards (NICs). Single-core packet-processing throughput has saturated.\nWe consider the problem of high-speed packet processing with multiple CPU cores. The key challenge is state—memory that multiple packets must read and update. The prevailing method to scale throughput with multiple cores involves state sharding, processing all packets that update the same state, e.g., flow, at the same core. However, given the skewed nature of realistic flow size distributions, this method is untenable, since total throughput is limited by single-core performance.\nThis paper introduces state-compute replication, a principle to scale the throughput of a single stateful flow across multiple cores using replication. Our design leverages a packet history sequencer running on a NIC or top-of-the-rack switch to enable multiple cores to update state without explicit synchronization. Our experiments with realistic data center and wide-area Internet traces show that state-compute replication can scale total packet-processing throughput linearly with cores, independent of flow size distributions, across a range of realistic packet-processing programs.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/xu-qiongwen",
    "session_title": "Middleboxes",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "5a01b364-1899-43b5-93f9-e4c8dd627612"
  },
  {
    "title": "MTP: Transport for In-Network Computing",
    "authors": "Tao Ji,UT Austin;Rohan Vardekar and Balajee Vamanan,University of Illinois Chicago;Brent E. Stephens,Google and University of Utah;Aditya Akella,UT Austin",
    "abstract": "In-network computing (INC) is being increasingly adopted to accelerate applications by offloading part of the applications’ computation to network devices. Such application-specific (L7) offloads have several attributes that the transport protocol must work with — they may mutate, intercept, reorder and\ndelay application messages that span multiple packets. At the same time the transport must also work with the buffering and computation constraints of network devices hosting the L7 offloads. Existing transports and alternative approaches fall short in these regards. Therefore, we present MTP, the first transport to natively support INC. MTP is built around two major components: 1) a novel message-oriented reliability protocol and 2) a resource-specific congestion control framework. We implement a full-fledged prototype of MTP based on DPDK. We show the efficacy of MTP in a testbed with a real INC application as well as with comprehensive microbenchmarks and large-scale simulations.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/ji",
    "session_title": "Middleboxes",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "6d6d2bbc-b1ef-4a07-b26c-0a906ae57c89"
  },
  {
    "title": "ONCache: A Cache-Based Low-Overhead Container Overlay Network",
    "authors": "Shengkai Lin, Shizhen Zhao, Peirui Cao, and Xinchi Han,Shanghai Jiao Tong University;Quan Tian, Wenfeng Liu, Qi Wu, and Donghai Han,Broadcom;Xinbing Wang,Shanghai Jiao Tong University",
    "abstract": "Recent years have witnessed a widespread adoption of containers. While containers simplify and accelerate application development, existing container network technologies either incur significant overhead, which hurts performance for distributed applications, or lose flexibility or compatibility, which hinders the widespread deployment in production.\nWe carefully analyze the kernel data path of an overlay network, quantifying the time consumed by each segment of the data path and identifying theextra overheadin an overlay network compared to bare metal. We observe that this extra overhead generates repetitive results among packets, which inspires us to introduce caches within an overlay network.\nWe design and implement ONCache (OverlayNetworkCache), a cache-based container overlay network, to eliminate the extra overhead while maintaining flexibility and compatibility. We implement ONCache using the extended Berkeley Packet Filter (eBPF) with only 524 lines of code, and integrate it as a plugin of Antrea. With ONCache, containers attain networking performance akin to that of bare metal. Compared to the standard overlay networks, ONCache improves throughput and request-response transaction rate by 12% and 36% for TCP (20% and 34% for UDP), respectively, while significantly reducing per-packet CPU overhead. Popular distributed applications also benefit from ONCache.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/lin-shengkai",
    "session_title": "Rethinking Data Center Efficiency",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "c3e6ed56-339d-4427-a08a-76aa62a461c9"
  },
  {
    "title": "GREEN: Carbon-efficient Resource Scheduling for Machine Learning Clusters",
    "authors": "Kaiqiang Xu and Decang Sun,Hong Kong University of Science and Technology;Han Tian,University of Science and Technology of China;Junxue Zhang and Kai Chen,Hong Kong University of Science and Technology",
    "abstract": "Data centers are a major source of carbon emissions and are subsequently contributing to global carbon footprints. Keeping in view of providing a sustainable solution to society, we have analyzed various factors that can help to achieve carbon neutrality and maximum sustainability. Our study pointed towards the need to follow a sustainable approach for incoming workflow throughout the life-cycle of Data centers. We analyzed that workloads need to be segregated before assigning them to the data centers so that energy-efficient resource allocation could be done. This paper demonstrates unsupervised learning techniques to cluster the incoming cloud workloads. The heterogeneous workloads were characterized using machine learning approaches and appropriate clusters were crafted. For analysis, Google Cluster Dataset is used. In order to improve the accuracy, data were normalized, and random samples of data were selected for clustering. The machine learning algorithms applied were able to successfully determine the appropriate clusters that can further be used for energy-efficient resource scheduling.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/xu-kaiqiang",
    "session_title": "Rethinking Data Center Efficiency",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "fadbb414-40a3-4eae-bb0e-1c3337e886d4"
  },
  {
    "title": "The Benefits and Limitations of User Interrupts for Preemptive Userspace Scheduling",
    "authors": "Linsong Guo, Danial Zuberi, Tal Garfinkel, and Amy Ousterhout,University of California, San Diego",
    "abstract": "Preemptive scheduling promises to mitigate head-of-line blocking and enable flexible scheduling while retaining a simple programming model. Despite this, preemption is underutilized in server-side software today. Instead, high-performance datacenter systems and language runtimes often rely on cooperative concurrency, or else use preemption only at very coarse timescales, limiting its effectiveness. A key reason that preemption is underutilized today is that existing preemption mechanisms have high and unpredictable overheads.\nIntel recently introduced support for user interrupts, a new feature that offers an opportunity to change this. By enabling interrupts to be sent and received entirely in user space, user interrupts can significantly lower the overhead of preemption. In this paper, we shed light on how user interrupts impact the landscape of preemption mechanisms. We build two user-level schedulers that leverage user interrupts for low-overhead preemption. We find that user interrupts are not a panacea. For example, they provide limited benefits when other software layers constrain the kinds of scheduling policies that can be used. Still, user interrupts can match or exceed the performance of existing mechanisms for all but the highest preemption rates, while achieving much more consistent overheads and retaining a user friendly programming model.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/guo",
    "session_title": "Rethinking Data Center Efficiency",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "90fd48dc-96ea-4ebf-a87f-fb84948cfce3"
  },
  {
    "title": "Securing Public Cloud Networks with Efficient Role-based Micro-Segmentation",
    "authors": "Sathiya Kumaran Mani and Kevin Hsieh,Microsoft Research;Santiago Segarra,Rice University;Ranveer Chandra,Microsoft;Yajie Zhou,University of Maryland;Srikanth Kandula,Microsoft Research",
    "abstract": "As information technology continues to evolve, cloud data centres have become increasingly prominent as the preferred infrastructure for data storage and processing. However, this shift has introduced a new array of security challenges, necessitating innovative approaches distinct from traditional network security architectures. In response, the Zero Trust Architecture (ZTA) has emerged as a promising solution, with micro-segmentation identified as a crucial component for enabling continuous auditing and stringent security controls. VxLAN technology is widely utilized in data centres for tenant isolation and virtual machine interconnection within tenant environments. Despite its prevalent use, limited research has focused on its application in micro-segmentation scenarios. To address this gap, we propose a method that leverages VLAN and VxLAN many-to-one mapping, requiring that all internal data centre traffic routes through the VxLAN gateway. This method can be implemented cost-effectively, without necessitating business modifications or causing service disruptions, thereby overcoming the challenges associated with micro-segmentation deployment. Importantly, this approach is based on standard public protocols, making it independent of specific product brands and enabling a network-centric framework that avoids software compatibility issues. To assess the effectiveness of our micro-segmentation approach, we provide a comprehensive evaluation that includes network aggregation and traffic visualization. Building on the implementation of micro-segmentation, we also introduce an enhanced asset behaviour algorithm. This algorithm constructs behavioural profiles based on the historical traffic of internal network assets, enabling the rapid identification of abnormal behaviours and facilitating timely defensive actions. Empirical results demonstrate that our algorithm is highly effective in detecting anomalous behaviour in intranet assets, making it a powerful tool for enhancing security in cloud data centres. In summary, the proposed approach offers a robust and efficient solution to the challenges of micro-segmentation in cloud data centres, contributing to the advancement of secure and reliable cloud infrastructure.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/mani",
    "session_title": "Rethinking Data Center Efficiency",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "1595fa82-70ed-4465-aafa-8a7c9ba76331"
  },
  {
    "title": "Mitigating Scalability Walls of RDMA-based Container Networks",
    "authors": "Wei Liu,Tsinghua University and Alibaba Cloud;Kun Qian,Alibaba Cloud;Zhenhua Li,Tsinghua University;Feng Qian,University of Southern California;Tianyin Xu,University of Illinois Urbana-Champaign;Yunhao Liu,Tsinghua University;Yu Guan, Shuhong Zhu, Xiongfei Xu, Lanlan Xi, Chao Qin, and Ennan Zhai,Alibaba Cloud",
    "abstract": "As a state-of-the-art technique, RDMA-offloaded container networks (RCNs) can provide high-performance data communications among containers. Nevertheless, this seems to be subject to the RCN scale—when there are millions of containers simultaneously running in a data center, the performance decreases sharply and unexpectedly. In particular, we observe that most performance issues are related to RDMA NICs (RNICs), whose design and implementation defects might constitute the \"scalability wall\" of the RCN. To validate the conjecture, however, we are challenged by the limited visibility into the internals of today's RNICs. To address the dilemma, a more pragmatic approach is to infer the most likely causes of the performance issues according to the common abstractions of an RNIC's components and functionalities.\nSpecifically, we conduct combinatorial causal testing to efficiently reason about an RNIC's architecture model, effectively approximate its performance model, and thereby proactively optimize the NF (network function) offloading schedule. We embody the design into a practical system dubbed ScalaCN. Evaluation on production workloads shows that the end-to-end network bandwidth increases by 1.4× and the packet forwarding latency decreases by 31%, after resolving 82% of the causes inferred by ScalaCN. We report the performance issues of RNICs and the most likely causes to relevant vendors, all of which have been encouragingly confirmed; we are now closely working with the vendors to fix them.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/liu-wei",
    "session_title": "RDMA",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "681f4e20-5527-4fdc-8e97-59f884be5861"
  },
  {
    "title": "Eden: Developer-Friendly Application-Integrated Far Memory",
    "authors": "Anil Yelam, Stewart Grant, and Saarth Deshpande,UC San Diego;Nadav Amit,Technion, Israel Institute of Technology;Radhika Niranjan Mysore,VMware Research Group;Amy Ousterhout,UC San Diego;Marcos K. Aguilera,VMware Research Group;Alex C. Snoeren,UC San Diego",
    "abstract": "Far memory systems are a promising way to address the resource stranding problem in datacenters. Far memory systems broadly fall into two categories. On one hand, paging-based systems use hardware guards at the granularity of pages to intercept remote accesses, which require no application changes but incur significant faulting overhead. On the other hand, app-integrated systems use software guards on data objects and apply application-specific optimizations to avoid faulting overheads, but these systems require significant application redesign and/or suffer from overhead on local accesses. We propose Eden, a new approach to far memory that combines hardware guards with a small number of software guards in the form of programmer annotations, to achieve performance similar to app-integrated systems with minimal developer effort. Eden is based on the insight that applications generate most of their page faults at a small number of code locations, and those locations are easy to find programmatically. By adding hints to such locations, Eden can notify the pager about upcoming memory accesses to customize read-ahead and memory reclamation. We show that Eden achieves 19.4–178% higher performance than Fastswap for memory-intensive applications including DataFrame and memcached. Eden achieves performance comparable to AIFM with almost 100× fewer code changes.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/yelam",
    "session_title": "RDMA",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "9db5371e-e861-4ff3-b357-48d92c5b2364"
  },
  {
    "title": "Achieving Wire-Latency Storage Systems by Exploiting Hardware ACKs",
    "authors": "Qing Wang, Jiwu Shu, Jing Wang, and Yuhao Zhang,Tsinghua University",
    "abstract": "We present Juneberry, a low-latency communication framework for storage systems. Different from existing RPC frameworks, Juneberry provides a fast path for storage requests: they can be committed with a single round trip and server CPU bypass, thus delivering extremely low latency; the execution of these requests is performed asynchronously on the server CPU. Juneberry achieves it by relying on our proposed Ordered Queue abstraction, which exploits NICs’ hardware ACKs as commit signals of requests while ensuring linearizability of the whole system. Juneberry also supports durability by placing requests in persistent memory (PM). We implement Juneberry using commodity RDMA NICs and integrate it into two storage systems: Memcached (a widely used in-memory caching system) and PMemKV (a PM-based persistent key-value store). Evaluation shows that compared with RPC, Juneberry can significantly lower their latency under write-intensive workloads.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wang-qing",
    "session_title": "RDMA",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "6cef4107-0736-4077-9707-466743741b3b"
  },
  {
    "title": "ODRP: On-Demand Remote Paging with Programmable RDMA",
    "authors": "Zixuan Wang, Xingda Wei, Jinyu Gu, Hongrui Xie, Rong Chen, and Haibo Chen,Institute of Parallel and Distributed Systems, SEIEE, Shanghai Jiao Tong University",
    "abstract": "Memory disaggregation with OS swapping is becoming popular for next-generation datacenters. RDMA is a promising technique for achieving this. However, RDMA does not support dynamic memory management in the data path. Current systems rely on RDMA’s control path operations, which are designed for coarse-grained memory management. This results in a trade-off between performance and memory utilization and also requires significant CPU usage, which is a limited resource on memory nodes.\nThis paper introduces On-Demand Remote Paging, the first system that smartly chains native RDMA data path primitives to offload all memory access and management operations onto the RDMA-capable NIC (RNIC). However, efficiently implementing these operations is challenging due to the limited capability of RNIC. ODRP leverages the semantics of OS swapping and adopts a client-assisted principle to address the efficiency and functionality challenges. Compared to the state-of-the-art system, ODRP can achieve significantly better memory utilization, no CPU usage while introducing only a 0.8% to 14.6% performance overhead in real-world applications.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wang-zixuan",
    "session_title": "RDMA",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "c67e9858-a3e3-4e25-9bd8-5b0d9ef9b7d3"
  },
  {
    "title": "Understanding and Profiling NVMe-over-TCP Using ntprof",
    "authors": "Yuyuan Kang and Ming Liu,University of Wisconsin-Madison",
    "abstract": "NVMe-over-TCP (NVMe/TCP) is an emerging remote storage protocol, increasingly adopted in enterprises and clouds. It establishes a high-performance reliable data channel between clients and storage targets to deliver block I/Os. Understanding and analyzing the protocol execution details and how well storage workloads run atop are pivotal for system developers and infrastructure engineers. However, our community lacks such a profiling utility, whereas existing solutions are ad-hoc, tedious, and heuristic-driven. Realizing it is challenging due to the unpredictable I/O workload profile, intricate system layer interaction, and deep execution pipeline.\nThis paper presents ntprof, a systematic, informative, and lightweight NVMe/TCP profiler. Our key idea is to view the NVMe/TCP storage substrate as a lossless switched network and apply network monitoring techniques. We model each on-path system module as a software switch, equip it with a programmable profiling agent on the data plane, and develop a proactive query interface for statistics collection and analysis. ntprof, comprising a kernel module and a user-space utility, allows developers to define various profiling tasks, incurs marginal overhead when co-locating with applications, and generates performance reports based on prescribed specifications. We build ntprof atop Linux kernel 5.15.143 and apply it in six cases, i.e., end-to-end latency breakdown, interference analysis, SW/HW bottleneck localization, and application performance diagnostic. ntprof is available at https://github.com/netlab-wisconsin/ntprof.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/kang",
    "session_title": "Storage",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "e0e3f16f-ab2b-4ab7-8625-26733c45dd46"
  },
  {
    "title": "Building an Elastic Block Storage over EBOFs Using Shadow Views",
    "authors": "Sheng Jiang,Carnegie Mellon University;Ming Liu,University of Wisconsin-Madison",
    "abstract": "The EBOF (Ethernet-Bunch-Of-Flash) has emerged as an enticing and promising disaggregated storage platform due to its streamlined I/O processing, high scalability, and substantial energy/cost-efficiency improvement. An EBOF applies a smart-sender dumb-receiver design philosophy and provides backward-compatible storage volumes to expedite system deployment. Yet, the static and opaque internal I/O processing pipeline lacks resource allocation, I/O scheduling, and traffic orchestration capabilities, entailing bandwidth waste, workload non-adaptiveness, and performance interference.\nThis paper presents the design and implementation of a distributed telemetry system (called shadow view) to tackle the above challenges and facilitate the effective use of an EBOF. We model an EBOF as a two-layer multi-switch architecture and develop a view development protocol to construct the EBOF running snapshot and expose internal execution statistics at runtime. Our design is motivated by the observation that fast data center networks make the overheads of inter-server communication and synchronization negligible. We demonstrate the effectiveness of shadow view by building a block storage (dubbed Flint) atop EBOFs. The enhanced I/O data plane allows us to develop new three techniques–an elastic volume manager, a view-enabled bandwidth auction mechanism, and an eIO scheduler. Our evaluations using the Fungible FS1600 EBOF show that a Flint volume achieves 9.3/9.2 GB/s read/write bandwidth with no latency degradation, significantly outperforming the defacto EBOF volume. It achieves up to 2.9× throughput improvements when running an object store. Flint is tenant-aware and remote target-aware, delivering efficient multi-tenancy and workload adaptiveness.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/jiang",
    "session_title": "Storage",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "8a8ef18c-3149-469e-b464-33fd6c9e3898"
  },
  {
    "title": "Pushing the Limits of In-Network Caching for Key-Value Stores",
    "authors": "Gyuyeong Kim,Sungshin Women's University",
    "abstract": "We present OrbitCache, a new in-network caching architecture that can cache variable-length items to balance a wide range of key-value workloads. Unlike existing works, OrbitCache does not cache hot items in the switch memory. Instead, we make hot items revisit the switch data plane continuously by exploiting packet recirculation. Our approach keeps cached key-value pairs in the switch data plane while freeing them from item size limitations caused by hardware constraints. We implement an OrbitCache prototype on an Intel Tofino switch. Our experimental results show that OrbitCache can balance highly skewed workloads and is robust to various system conditions.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/kim",
    "session_title": "Storage",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "372196e5-6d69-442f-9696-e9bcf9d2ed66"
  },
  {
    "title": "CellReplay: Towards accurate record-and-replay for cellular networks",
    "authors": "William Sentosa,University of Illinois at Urbana Champaign;Balakrishnan Chandrasekaran,Vrije Universiteit Amsterdam;Brighten Godfrey,UIUC and Broadcom;Haitham Hassanieh,EPFL",
    "abstract": "The inherent variability of real-world cellular networks makes it hard to evaluate, reproduce, and debug the performance of networked applications running on these networks. A common approach is to record and replay a trace of observed cellular network performance. However, we show that the state-of-the-art record-and-replay technique produces empirically inaccurate results that can cause evaluation bias. This paper presents the design and implementation of CellReplay, a tool that records the time-varying performance of a live cellular network into traces using preset workloads and faithfully replays the observed performance for other workloads through an emulated network interface. The key challenge in achieving high accuracy is to replay varying network behavior in a way that captures its sensitivity to the workload. CellReplay records network behavior under two predefined workloads simultaneously and interpolates upon replay for other workloads. Across various challenging network conditions, our evaluation shows that real-world networked applications (e.g., web browsing or video streaming) running on CellReplay achieve similar performance (e.g., page load time or bitrate selection) to their live network counterparts, with significantly reduced error compared to the prior method.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/sentosa",
    "session_title": "Cellular and Wireless",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "936a9dbe-a6e5-427b-8710-b7ae7f45e280"
  },
  {
    "title": "Large Network UWB Localization: Algorithms and Implementation",
    "authors": "Nakul Garg and Irtaza Shahid,University of Maryland, College Park;Ramanujan K Sheshadri,Nokia Bell Labs;Karthikeyan Sundaresan,Georgia Institute of Technology;Nirupam Roy,University of Maryland, College Park",
    "abstract": "Localization of networked nodes is an essential problem in emerging applications, including first-responder navigation, automated manufacturing lines, vehicular and drone navigation, asset tracking, Internet of Things, and 5G communication networks. In this paper, we present Locate3D, a novel system for peer-to-peer node localization and orientation estimation in large networks. Unlike traditional range-only methods, Locate3D introduces angle-of-arrival (AoA) data as an added network topology constraint. The system solves three key challenges: it uses angles to reduce the number of measurements required by 4× and jointly uses range and angle data for location estimation. We develop a spanning-tree approach for fast location updates, and to ensure the output graphs are rigid and uniquely realizable, even in occluded or weakly connected areas. Locate3D cuts down latency by up to 75% without compromising accuracy, surpassing standard range-only solutions. It has a 0.86 meter median localization error for building-scale multi-floor networks (32 nodes, 0 anchors) and 12.09 meters for large-scale networks (100,000 nodes, 15 anchors).",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/garg",
    "session_title": "Cellular and Wireless",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "aa3a2443-8658-4ba6-b9bb-0657b3bf6b9e"
  },
  {
    "title": "Towards Energy Efficient 5G vRAN Servers",
    "authors": "Anuj Kalia,Microsoft;Nikita Lazarev,MIT;Leyang Xue,The University of Edinburgh;Xenofon Foukas and Bozidar Radunovic,Microsoft;Francis Y. Yan,Microsoft Research and UIUC",
    "abstract": "We study the problem of improving energy efficiency in virtualized radio access network (vRAN) servers, focusing on CPUs. Two distinct characteristics of vRAN software—strict real-time sub-millisecond deadlines and its proprietary black-box nature—preclude the use of existing general-purpose CPU energy management techniques. This paper presents RENC, a system that saves energy by adjusting CPU frequency in response to sub-second variations in cellular workloads, using the following techniques. First, despite large fluctuations in vRAN CPU load at sub-ms timescales, RENC establishes safe low-load intervals, e.g., by coupling Media Access Control (MAC) layer rate limiting with CPU frequency changes. This prevents high traffic during low-power operation, which would otherwise cause deadline misses. Second, we design techniques to compute CPU frequencies that are safe for these low-load intervals, achieved by measuring the slack in vRAN threads' deadlines using Linux eBPF hooks, or minor binary rewriting of the vRAN software. Third, we demonstrate the need to handle CPU load spikes triggered by control operations, such as new users attaching to the network. Our evaluation in a state-of-the-art vRAN testbed shows that our techniques reduces a vRAN server's CPU power consumption by up to 45% (29% server-wide).",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/kalia",
    "session_title": "Cellular and Wireless",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "cb7efede-9eec-4aec-9c7f-de948776aa10"
  },
  {
    "title": "Building Massive MIMO Baseband Processing on a Single-Node Supercomputer",
    "authors": "Xincheng Xie, Wentao Hou, Zerui Guo, and Ming Liu,University of Wisconsin-Madison",
    "abstract": "The rising deployment of massive MIMO coupled with the wide adoption of virtualized radio access networks (vRAN) poses an unprecedented computational demand on the baseband processing, hardly met by existing vRAN hardware substrates. The single-node supercomputer, an emerging computing platform, offers scalable computation and communication capabilities, making it a promising target to hold and run the baseband pipeline. However, realizing this is non-trivial due to the mismatch between (a) the diverse execution granularities and incongruent parallel degrees of different stages along the software processing pipeline and (b) the underlying evolving irregular hardware parallelism at runtime.\nThis paper closes the gap by designing and implementing MegaStation–an application-platform co-designed system that effectively harnesses the computing power of a single-node supercomputer for processing massive MIMO baseband. Our key insight is that one can adjust the execution granularity and reconstruct the baseband processing pipeline on the fly based on the monitored hardware parallelism status. Inspired by dynamic instruction scheduling, MegaStation models the single-node supercomputer as a tightly coupled microprocessor and employs a scoreboarding-like algorithm to orchestrate \"baseband processing\" instructions over GPU-instantiated executors. Our evaluations using the GigaIO FabreX demonstrate that MegaStation achieves up to 66.2% lower tail frame processing latency and 4× higher throughput than state-of-the-art solutions. MegaStation is a scalable and adaptive solution that can meet today’s vRAN requirements.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/xie",
    "session_title": "Cellular and Wireless",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "336246e0-79a9-4c75-b1b9-25af6e1650ec"
  },
  {
    "title": "Efficient Multi-WAN Transport for 5G with OTTER",
    "authors": "Mary Hogan,Oberlin College;Gerry Wan,Google;Yiming Qiu,University of Michigan;Sharad Agarwal and Ryan Beckett,Microsoft Corporation;Rachee Singh,Cornell University;Paramvir Bahl,Microsoft Corporation",
    "abstract": "In the ongoing cloudiﬁcation of 5G, software network functions (NFs) are replacing ﬁxed-function network hardware, allowing 5G network operators to leverage the beneﬁts of cloud computing. The migration of NFs and their management to the cloud causes 5G trafﬁc to traverse an operator’s wide-area network (WAN) to the cloud WAN that hosts the datacenters (DCs) running 5G NFs and applications. However, achieving end-to-end (E2E) performance for 5G trafﬁc across two WANs is hard. Placing 5G ﬂows across two WANs with different performance and reliability characteristics, edge and DC resource constraints, and interference from other ﬂows is different and more challenging than single-WAN trafﬁc engineering. We address this challenge and show that orchestrating E2E paths across a multi-WAN overlay allows us to achieve average 13% more throughput, 15% less RTT, 45% less jitter, or reduce average loss from 0.06% to under 0.001%. We implement our multi-WAN 5G ﬂow placement in a scalable optimization prototype that allocates 26%–45% more bytes on the network than greedy baselines while also satisfying the service demands of more ﬂows.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/hogan",
    "session_title": "Cellular and Wireless",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "0546c658-2c18-4940-a3e0-db9f2a3dbf01"
  },
  {
    "title": "Verifying maximum link loads in a changing world",
    "authors": "Tibor Schneider,ETH Zürich;Stefano Vissicchio,University College London (UCL);Laurent Vanbever,ETH Zürich",
    "abstract": "To meet ever more stringent requirements, network operators often need to reason about worst-case link loads. Doing so involves analyzing traffic forwarding after failures and BGP route changes. State-of-the-art systems identify failure scenarios causing congestion, but they ignore route changes.\nWe present Velo, the first verification system that efficiently finds maximum link loads under failures and route changes. The key building block of Velo is its ability to massively reduce the gigantic space of possible route changes thanks to (i) a router-based abstraction for route changes, (ii) a theoretical characterization of scenarios leading to worst-case link loads, and (iii) an approximation of input traffic matrices. We fully implement and extensively evaluate Velo. Velo takes only a few minutes to accurately compute all worst-case link loads in large ISP networks. It thus provides operators with critical support to robustify network configurations, improve network management and take business decisions.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/schneider",
    "session_title": "Verification 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "f5627c35-56b4-4727-95f8-e164664b8b44"
  },
  {
    "title": "A Layered Formal Methods Approach to Answering Queue-related Queries",
    "authors": "Divya Raghunathan, Aarti Gupta, and Maria Apostolaki,Princeton University",
    "abstract": "Queue dynamics introduce significant uncertainty in network management tasks such as debugging, performance monitoring, and analysis. Despite numerous queue-monitoring techniques, many networks today continue to collect only per-port packet counts (e.g., using SNMP). Although queue lengths are correlated with packet counts, deriving the precise correlation between them is very challenging since packet counts do not specify many quantities (e.g., packet arrival order) which affect queue lengths.\nThis paper presents QuASI, a system that can answer many queue-related queries using only coarse-grained per-port packet counts. QuASI checks whether there exists a packet trace that is consistent with the packet counts and satisfies a query. To scale on large problem instances, QuASI relies on a layered approach and on a novel enqueue-rate abstraction, which is lossless for the class of queries that QuASI answers. The first layer employs a novel and efficient algorithm that generates a cover-set of abstract traces, constructs representative abstract traces from the cover-set, and efficiently checks each representative abstract trace by leveraging a known result on (0,1)-matrix existence. The first layer guarantees no false negatives: if the first layer says \"No\", there is no packet trace consistent with the observed packet counts that makes the query true. If it says \"Yes\", further verification is needed, which the second layer resolves using an SMT solver. As a result, QuASI has no false positives and no false negatives.\nOur evaluations show that QuASI is up to 106X faster than state-of-the-art, and can answer non-trivial queries about queue metrics (e.g., queue length) using minute-granularity packet counts. Our work is the first step toward more practical formal performance analysis under given measurements.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/raghunathan",
    "session_title": "Verification 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "fdec695e-c687-4069-95fb-89830a7ccfff"
  },
  {
    "title": "Runtime Protocol Refinement Checking for Distributed Protocol Implementations",
    "authors": "Ding Ding,New York University;Zhanghan Wang and Jinyang Li,NYU;Aurojit Panda,New York University",
    "abstract": "Despite significant progress in verifying protocols, services that implement distributed protocols (we refer to these as DPIs in what follows), e.g., Chubby or Etcd, can exhibit safety bugs in production deployments. These bugs are often introduced by programmers when converting protocol descriptions into code. This paper introduces Runtime Protocol Refinement Checking (RPRC) a runtime approach for detecting protocol implementation bugs in DPIs. RPRC systems observe a deployed DPI's runtime behavior and notify operators when this behavior evidences a protocol implementation bug, allowing operators to mitigate the bugs impact and developers to fix the bug. We have developed an algorithm for RPRC and implemented it in a system called Ellsberg that targets DPIs that assume fail-stop failures and the asynchronous (or partially synchronous) model. Our goal when designing Ellsberg was to make no assumptions about how DPIs are implemented, and to avoid additional coordination or communication. Therefore, Ellsberg builds on the observation that in the absence of Byzantine failures, a protocol safety properties are maintained if all live DPI processes correctly implement the protocol. Thus, Ellsberg checks RPRC by comparing messages sent and received by each DPI process to those produced by a simulated execution of the protocol. We apply Ellsberg to three open source DPIs, Etcd, Zookeeper and Redis Raft, and show that we can detect previously reported protocol bugs in these DPIs.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/ding",
    "session_title": "Verification 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "59e4bfe2-b0c3-423a-aeff-d8b3bfb314ac"
  },
  {
    "title": "CEGS: Configuration Example Generalizing Synthesizer",
    "authors": "Jianmin Liu,Tsinghua University;Li Chen,Zhongguancun Laboratory;Dan Li,Tsinghua University, Zhongguancun Laboratory;Yukai Miao,Zhongguancun Laboratory",
    "abstract": "Network configuration synthesis promises to increase the efficiency of network management by reducing human involvement. However, despite significant advances in this field, existing synthesizers still require much human effort in drafting configuration templates or coding in a domain-specific language. We argue that the main reason for this is that a core capability is missing for current synthesizers: identifying and following configuration examples in configuration manuals and generalizing them to arbitrary topologies.\nIn this work, we fill this capability gap with two recent advancements in artificial intelligence: graph neural networks (GNNs) and large language models (LLMs). We build CEGS, which can automatically identify appropriate configuration examples, follow and generalize them to fit target network scenarios. CEGS features a GNN-based Querier to identify relevant examples from device documentations, a GNN-based Classifier to generalize the example to arbitrary topology, and an efficient LLM-driven synthesis method to quickly and correctly synthesize configurations that comply with the intents. Evaluations of real-world networks and complex intents show that CEGS can automatically synthesize correct configurations for a network of 1094 devices without human involvement. In contrast, the state-of-the-art LLM-based synthesizer are more than 30 times slower than CEGS on average, even when human experts are in the loop.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/liu-jianmin",
    "session_title": "Verification 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "40c0d464-3734-47f5-8308-886671449bb4"
  },
  {
    "title": "Suppressing BGP Zombies with Route Status Transparency",
    "authors": "Yosef Edery Anahory,Hebrew University of Jerusalem;Jie Kong and Nicholas Scaglione,University of Connecticut;Hemi Leibowitz,College of Management Academic Studies;Yossi Gilad,Hebrew University of Jerusalem;Amir Herzberg and Bing Wang,University of Connecticut",
    "abstract": "Withdrawal suppression has been a known weakness of BGP for over a decade. It has a significant detrimental impact on both the reliability and security of inter-domain routing on the Internet. This paper presents Route Status Transparency (RoST), the first design that efficiently and securely thwarts withdrawal suppression misconfigurations and attacks. RoST allows ASes to efficiently verify whether a route has been withdrawn; it is compatible with BGP as well as with BGP security enhancements. We use simulations on the Internet’s AS-level topology to evaluate the benefits from adopting RoST. We use an extensive real-world BGP announcements dataset to show that it is efficient in terms of storage, bandwidth, and computational requirements.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/anahory",
    "session_title": "Security",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "27697644-cf1f-492a-a972-c4d67b78f71f"
  },
  {
    "title": "ValidaTor: Domain Validation over Tor",
    "authors": "Jens Frieß,Fraunhofer SIT;Haya Schulmann,GU;Michael Waidner,National Research Center for Applied Cybersecurity ATHENE, Fraunhofer Institute for Secure Information Technology SIT, Technische Universität Darmstadt",
    "abstract": "Although the anonymous communication network Tor can protect the security of users’ data and privacy during their visits to the Internet, it also facilitates illegal users to access illegal websites. Website fingerprinting attacks can identify the websites that users are visiting to discern whether they are performing illegal operations. Existing methods tend to manually extract the traffic features of users visiting websites and construct machine learning or deep learning models to classify the features. While these methods can be effective in classifying unknown website traffic, the effect of classification in the use of defensive measures or onion service scenarios is not yet ideal. This paper proposes a method to identify Tor users visiting websites based on frequency domain fingerprinting of network traffic (FDF). We extract the direction and length features of circuit sequences in access traffic and combine and transform them into the frequency domain. The classification of access traffic is accomplished by using a deep learning classification model combining CNN, FC, and Self-Attention. In this paper, the proposed FDF method is experimentally validated in common scenarios of Tor networks. The results show that FDF outperforms the existing methods for classification in different Tor scenarios. It can achieve 98.8% and 94.3% classification accuracy in undefended and WTF-PAD defense scenarios, respectively. In the onion service scenario, the accuracy is improved by 4.7% over the current state-of-the-art Tik-Tok method.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/friess",
    "session_title": "Security",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "20fd9c1c-dd63-4cd7-9e9a-d0abb9b82a7c"
  },
  {
    "title": "Improving RPKI Efficiency: h^2ROV for Accelerating Validation Performance and Reducing Memory Overhead",
    "authors": "ZeDong Ni,School of Cyber Science & Engineering, Southeast University;Yinbo Xu, Hui Zou, and Yanbiao Li,CNIC CAS; UCAS, China;Guang Cheng,School of Cyber Science & Engineering, Southeast University;Gaogang Xie,CNIC CAS; UCAS, China",
    "abstract": "Route Origin Validation (ROV) with Route Origin Authorizations (ROAs), built on top of the Resource Public Key Infrastructure (RPKI), serves as the only formally standardized and production-grade defense mechanism against route hijackings in global interdomain routing infrastructures. However, the widespread adoption of RPKI has introduced escalating scalability challenges in validating high volumes of route messages against massive ROA entries.\nIn this paper, we attribute the performance bottleneck of existing ROV schemes to their underlying validation model, where the route is matched against rules in the form of address blocks. To overcome this bottleneck, we propose the Authorized Prefix (AP) model that enables validation at the prefix granularity, and redesign RPKI ROV based on this new model with a hierarchical hashing scheme named h2ROV. Extensive evaluations verify h2ROV's superiority over state-of-the-art approaches in IPv4, with a speedup of $1.7× ∼ 9.8× in validation and a reduction of 49.3% ∼ 86.6% in memory consumption.  System emulations using real-world network topologies further demonstrate h2ROV confines its impact to routing convergence to below 8.5% during update burst events, while reducing ROV-induced delays by 30.4% ∼ 64.7% compared to existing solutions.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/ni",
    "session_title": "Security",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "c46509a0-56d8-4268-a9fa-3aa757b6ec39"
  },
  {
    "title": "PreAcher: Secure and Practical Password Pre-Authentication by Content Delivery Networks",
    "authors": "Shihan Lin,Duke University;Suting Chen,Northwestern University;Yunming Xiao,University of Michigan;Yanqi Gu,University of California, Irvine;Aleksandar Kuzmanovic,Northwestern University; Xiaowei Yang,Duke University;",
    "abstract": "In today's Internet, websites widely rely on password authentication for user logins. However, the intensive computation required for password authentication exposes web servers to Application-layer DoS (ADoS) attacks that exploit the login interfaces. Existing solutions fail to simultaneously prevent such ADoS attacks, preserve password secrecy, and maintain good usability. In this paper, we present PreAcher, a system architecture that incorporates third-party Content Delivery Networks (CDNs) into the password authentication process and offloads the authentication workload to CDNs without divulging the passwords to them. At the core of PreAcher is a novel three-party authentication protocol that combines Oblivious Pseudorandom Function (OPRF) and Locality-Sensitive Hashing (LSH). This protocol allows CDNs to pre-authenticate users and thus filter out ADoS traffic without compromising password security. Our evaluations demonstrate that PreAcher significantly enhances the resilience of web servers against both ADoS attacks and preserves password security while introducing acceptable overheads. Notably, PreAcher can be deployed immediately by websites alone today, without modifications to client software or CDN infrastructure. We release the source code of PreAcher to facilitate its deployment and future research.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/lin-shihan",
    "session_title": "Security",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "0c364896-17c3-472f-8e90-cecd6006d2aa"
  },
  {
    "title": "ClubHeap: A High-Speed and Scalable Priority Queue for Packet Scheduling",
    "authors": "Zhikang Chen,Tsinghua University;Haoyu Song,Futurewei Technologies;Zhiyu Zhang and Yang Xu,Fudan University;Bin Liu,Tsinghua University",
    "abstract": "While PIFO is a powerful priority queue abstraction to support programmable packet scheduling in network devices, the efficient implementation of PIFO faces multiple challenges in performance and scalability. The existing solutions all fall short of certain requirements. In this paper, we propose ClubHeap to address the problem. On the one hand, we develop a novel hardware-friendly heap data structure to support faster PIFO queue operations that can schedule a flow in every clock cycle, reaching the theoretical lower bound; on the other hand, the optimized hardware architecture reduces the circuit complexity and thus enables a higher clock frequency. The end result is the best scheduling performance in its class. Combined with its inherently better scalability and flexibility, ClubHeap is an ideal solution to be built in programmable switches and SmartNICs to support various scheduling algorithms. We build an FPGA-based hardware prototype and conduct a thorough evaluation by comparing ClubHeap with the other state-of-the-art solutions. ClubHeap also allows graceful trade-offs between throughput and resource consumption through parameter adjustments, making it adaptable on different target devices.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/chen-zhikang",
    "session_title": "Data Plane Programmability 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "0902e397-5d0c-4a7d-a80b-4dc79081a5c7"
  },
  {
    "title": "Self-Clocked Round-Robin Packet Scheduling",
    "authors": "Erfan Sharafzadeh,Johns Hopkins University;Raymond Matson,University of California, Riverside;Jean Tourrilhes and Puneet Sharma,Hewlett Packard Labs;Soudeh Ghorbani,Meta and Johns Hopkins University",
    "abstract": "In this paper, we develop a general model, called latency-rate servers (LR-servers), for the analysis of traffic scheduling algorithms in broadband packet networks. The behavior of an LR scheduler is determined by two parameters-the latency and the allocated rate. We show that several well-known scheduling algorithms, such as weighted fair queueing, virtualclock, self-clocked fair queueing, weighted round robin, and deficit round robin, belong to the class of LR-servers. We derive tight upper bounds on the end-to-end delay, internal burstiness, and buffer requirements of individual sessions in an arbitrary network of LR-servers in terms of the latencies of the individual schedulers in the network, when the session traffic is shaped by a leaky bucket. Thus, the theory of LR-servers enables computation of tight upper-bounds on end-to-end delay and buffer requirements in a network of servers in which the servers on a path may not all use the same scheduling algorithm. We also define a self-contained approach to evaluate the fairness of LR-servers and use it to compare the fairness of many well-known scheduling algorithms.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/sharafzadeh",
    "session_title": "Data Plane Programmability 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "53c4272d-f59a-491f-bc11-a8ecc570f870"
  },
  {
    "title": "Everything Matters in Programmable Packet Scheduling",
    "authors": "Albert Gran Alcoz,ETH Zürich;Balázs Vass,Budapest University of Technology and Economics;Pooria Namyar,University of Southern California;Behnaz Arzani,Microsoft Research;Gábor Rétvári,Budapest University of Technology and Economics;Laurent Vanbever,ETH Zürich",
    "abstract": "Operators can deploy any scheduler they desire on existing switches through programmable packet schedulers: they tag packets with ranks (which indicate their priority) and schedule them in the order of these ranks. The ideal programmable scheduler is the Push-In First-Out (PIFO) queue, which schedules packets in a perfectly sorted order by \"pushing\" packets into any position of the queue based on their ranks. However, it is hard to implement PIFO queues in hardware due to their need to sort packets at line rate (based on their ranks).\nRecent proposals approximate PIFO behaviors on existing data-planes. While promising, they fail tosimultaneouslycapture both of thenecessarybehaviors of PIFO queues: theirscheduling behaviorandadmission control. We introduce PACKS, an approximate PIFO scheduler that addresses this problem. PACKS runs on top of a set of priority queues and uses packet-rank information and queue-occupancy levels during enqueue to determine whether to admit each incoming packet and to which queue it should be mapped.\nWe fully implement PACKS in P4 and evaluate it on real workloads. We show that PACKS better-approximates PIFO than state-of-the-art approaches. Specifically, PACKS reduces the rank inversions by up to 7× and 15× with respect to SP-PIFO and AIFO, and the number of packet drops by up to 60% compared to SP-PIFO. Under pFabric ranks, PACKS reduces the mean FCT across small flows by up to 33% and 2.6×, compared to SP-PIFO and AIFO. We also show that PACKS runs at line rate on existing hardware (Intel Tofino).",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/alcoz",
    "session_title": "Data Plane Programmability 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "6e399369-2a5f-438b-a67f-0ecb0cae9855"
  },
  {
    "title": "When P4 Meets Run-to-completion Architecture",
    "authors": "Hao Zheng,State Key Laboratory for Novel Software Technology, Nanjing University, China;Xin Yan,Huawei, China;Wenbo Li, Jiaqi Zheng, and Xiaoliang Wang,State Key Laboratory for Novel Software Technology, Nanjing University, China;Qingqing Zhao, Luyou He, Xiaofei Lai, Feng Gao, and Fuguang Huang,Huawei, China;Wanchun Dou, Guihai Chen, and Chen Tian,State Key Laboratory for Novel Software Technology, Nanjing University, China",
    "abstract": "P4 programmable data planes have significantly accelerated the evolution of various network technologies. Although the P4 language has gained wide acceptance, its further development encounters two obstacles: limited programmability and the cessation of the next-generation Tofino chip. As a hardware manufacturer, we try to address the above dilemmas by opening the P4 programmability of our run-to-completion (RTC) chips. At present, there is no publicly available experience in this field. We introduce P4RTC, a comprehensive consolidation of our experiences applying the P4 language to RTC architecture. P4RTC introduces a new P4 architecture model and a set of beneficial extern constructs to fully leverage the RTC architecture’s programmability. Besides, we share the insights we have gained from designing and implementing compilers. We also provide a performance model to facilitate profiling P4RTC’s performance on user-customized P4 code. We prototype P4RTC on an RTC chip with 1.2 Tbps bandwidth. Case-oriented evaluation demonstrates that P4RTC can enhance P4 programmability and reduce the burdens of RTC development. The performance model can provide substantial insights into optimizing P4RTC programs.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/zheng-hao",
    "session_title": "Data Plane Programmability 2",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "eb6d0ee2-8827-4b6e-b016-c935f57dd70b"
  },
  {
    "title": "Mutant: Learning Congestion Control from Existing Protocols via Online Reinforcement Learning",
    "authors": "Lorenzo Pappone,Computer Science Department, Saint Louis University;Alessio Sacco,DAUIN, Politecnico di Torino;Flavio Esposito,Computer Science Department, Saint Louis University",
    "abstract": "Learning how to control congestion remains a challenge despite years of progress. Existing congestion control protocols have demonstrated efficacy within specific network conditions, inevitably behaving suboptimally or poorly in others. Machine learning solutions to congestion control have been proposed, though relying on extensive training and specific network configurations. In this paper, we loosen such dependencies by proposing Mutant, an online reinforcement learning algorithm for congestion control that adapts to the behavior of the best-performing schemes, outperforming them in most network conditions. Design challenges included determining the best protocols to learn from, given a network scenario, and creating a system able to evolve to accommodate future protocols with minimal changes. Our evaluation on real-world and emulated scenarios shows that Mutant achieves lower delays and higher throughput than prior learning-based schemes while maintaining fairness by exhibiting negligible harm to competing flows, making it robust across diverse and dynamic network conditions.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/pappone",
    "session_title": "ML for Networks",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "dc714e24-22a1-485c-bc0f-93cb1dfbab48"
  },
  {
    "title": "CATO: End-to-End Optimization of ML-Based Traffic Analysis Pipelines",
    "authors": "Gerry Wan,Stanford University;Shinan Liu,University of Chicago;Francesco Bronzino,ENS Lyon;Nick Feamster,University of Chicago;Zakir Durumeric,Stanford University",
    "abstract": "Machine learning has shown tremendous potential for improving the capabilities of network traffic analysis applications, often outperforming simpler rule-based heuristics. However, ML-based solutions remain difficult to deploy in practice. Many existing approaches only optimize the predictive performance of their models, overlooking the practical challenges of running them against network traffic in real time. This is especially problematic in the domain of traffic analysis, where the efficiency of the serving pipeline is a critical factor in determining the usability of a model. In this work, we introduce CATO, a framework that addresses this problem by jointly optimizing the predictive performance and the associated systems costs of the serving pipeline. CATO leverages recent advances in multi-objective Bayesian optimization to efficiently identify Pareto-optimal configurations, and automatically compiles end-to-end optimized serving pipelines that can be deployed in real networks. Our evaluations show that compared to popular feature optimization techniques, CATO can provide up to 3600x lower inference latency and 3.7x higher zero-loss throughput while simultaneously achieving better model performance.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wan-gerry",
    "session_title": "ML for Networks",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "a1c0c526-bea3-4611-b67a-02ee679abe46"
  },
  {
    "title": "Resolving Packets from Counters: Enabling Multi-scale Network Traffic Super Resolution via Composable Large Traffic Model",
    "authors": "Xizheng Wang,Tsinghua University;Li Chen and Libin Liu,Zhongguancun Laboratory;Dan Li,Tsinghua University, Zhongguancun Laboratory;Yukai Miao and Yu Bai,Zhongguancun Laboratory",
    "abstract": "Realistic fine-grained traffic traces are valuable to numerous applications in both academia and industry. However, obtaining them directly from devices is significantly challenging, while coarse-grained counters are readily available on almost all network devices. None of existing work can restore fine-grained traffic traces from counters, which we call network traffic super-resolution (TSR). To this end, we propose ZOOMSYNTH, the first TSR system that can achieve packet-level trace synthesis with counter traces as input. Following the basic structure of the TSR task, we design the Granular Traffic Transformer (GTT) model and the Composable Large Traffic Model (CLTM). CLTM is a tree of GTT models, and the GTT models in each layer perform upscaling on a particular granularity, which allows each GTT model to capture the traffic characteristics at this resolution. Using CLTM, we synthesize fine-grained traces from counters. We also leverage a rule-following model to comprehend counter rules (e.g. ACLs) when available, guiding the generations of fine-grained traces. We implement ZOOMSYNTH and perform extensive evaluations. Results show that, with only second-level counter traces, ZOOMSYNTH achieves synthesis quality comparable to existing solutions that takes packet-level traces as input. CLTM can also be fine-tuned to support downstream tasks. For example, ZOOMSYNTH with fine-tuned CLTM outperforms the existing solution by 27.5% and 9.8% in anomaly detection and service recognition tasks, respectively. To promote future research, we release the pre-trained CLTM-1.8B model weights along with its source code.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wang-xizheng-resolving",
    "session_title": "ML for Networks",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "67d9e4c3-be8e-4a8e-9fd7-58011f26b04c"
  },
  {
    "title": "BFTBrain: Adaptive BFT Consensus with Reinforcement Learning",
    "authors": "Chenyuan Wu and Haoyun Qin,University of Pennsylvania;Mohammad Javad Amiri,Stony Brook University;Boon Thau Loo,University of Pennsylvania;Dahlia Malkhi,UC Santa Barbara;Ryan Marcus,University of Pennsylvania",
    "abstract": "This paper presents BFTBrain, a reinforcement learning (RL) based Byzantine fault-tolerant (BFT) system that provides significant operational benefits: a plug-and-play system suitable for a broad set of hardware and network configurations, and adjusts effectively in real-time to changing fault scenarios and workloads. BFTBrain adapts to system conditions and application needs by switching between a set of BFT protocols in real-time. Two main advances contribute to BFTBrain’s agility and performance. First, BFTBrain is based on a systematic, thorough modeling of metrics that correlate the performance of the studied BFT protocols with varying fault scenarios and workloads. These metrics are fed as features to BFTBrain’s RL engine in order to choose the best-performing BFT protocols in real-time. Second, BFTBrain coordinates RL in a decentralized manner which is resilient to adversarial data pollution, where nodes share local metering values and reach the same learning output by consensus. As a result, in addition to providing significant operational benefits, BFTBrain improves throughput over fixed protocols by 18% to 119% under dynamic conditions and outperforms state-of-the-art learning based approaches by 44% to 154%.",
    "link": "https://www.usenix.org/conference/nsdi25/presentation/wu-chenyuan",
    "session_title": "ML for Networks",
    "conference_name": "NSDI",
    "date": "2025-04-28",
    "paper_id": "19b83c86-b33c-4a0c-9dc1-fb42efce6623"
  }
]